
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура;
	ПараметрыОткрытия = ПолучитьПараметрыОткрытияОтчета("ОтчетЗаДень");
	ОткрытьФорму("Отчет.ОтчетЗаДень.Форма", ПараметрыОткрытия, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеОтборы(ПараметрыФормы)
	ПараметрыФормы.Вставить("Период", НачалоДня(ТекущаяДатаСеанса()));
	Отбор = Новый Структура("Сотрудник", Пользователи.ТекущийПользователь().Сотрудник);
	ПараметрыФормы.Вставить("Отбор", Отбор);
КонецФункции

&НаСервере
Функция УстановитьПользовательскиеНастройкиОтчета(КомпоновщикНастроек)
	ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных("Период");
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки);
	ПараметрСКД.Значение = НачалоДня(ТекущаяДатаСеанса());
	ПараметрСКД.Использование = Истина;
	
	Если ЗначениеЗаполнено(ПараметрСКД.ИдентификаторПользовательскойНастройки) Тогда
	
		ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
		   ПараметрСКД.ИдентификаторПользовательскойНастройки);
		Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			ПользовательскийПараметр.Значение = ПараметрСКД.Значение;
		КонецЕсли;

	КонецЕсли;	
	
	ОтборСотрудник = Неопределено;
	Для Каждого ЭлОтбора ИЗ КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ЭлОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сотрудник") Тогда
			ОтборСотрудник = ЭлОтбора;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Не ОтборСотрудник = Неопределено Тогда
		ЭлементОтбораПользовательский = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ОтборСотрудник.ИдентификаторПользовательскойНастройки);

		ЭлементОтбораПользовательский.ПравоеЗначение = Пользователи.ТекущийПользователь().Сотрудник;
		ЭлементОтбораПользовательский.Использование = Истина;
	КонецЕсли;
КонецФункции


&НаСервере
Функция ПолучитьПараметрыОткрытияОтчета(ИмяОтчета)
	
	ОтчетОбъект = Отчеты[ИмяОтчета].Создать();
	
	КомпоновщикНастроек = ОтчетОбъект.КомпоновщикНастроек;
	
	УстановитьПользовательскиеНастройкиОтчета(КомпоновщикНастроек);
		
	ПараметрыОткрытия = Новый Структура(); 	
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыОткрытия.Вставить("ПользовательскиеНастройки", КомпоновщикНастроек.ПользовательскиеНастройки);
	ПараметрыОткрытия.Вставить("РежимПоНастройкамКомпоновки");			
	Возврат ПараметрыОткрытия;

КонецФункции

