

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ПараметрыОтбора = Новый Структура("ТипДоговора", ПредопределенноеЗначение("Перечисление.ТипыДоговоров.ДТ4"));
	
	Форма = ОткрытьФорму("Справочник.Договоры.ФормаСписка",
	Новый Структура("Отбор, УстановитьВидимостьКолонок", ПараметрыОтбора, Истина),
		ПараметрыВыполненияКоманды.Источник,
		Новый УникальныйИдентификатор,
		ПараметрыВыполненияКоманды.Окно);
	Форма.АвтоЗаголовок  = Ложь;
	Форма.Заголовок = "Договоры (ДТ4)";

КонецПроцедуры

#КонецОбласти

