
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Организация) Тогда 
		Организация = Константы.ОрганизацияПоУмолчанию.Получить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПлановыеЦеныНаРесурсы
	Движения.ПлановыеЦеныНаРесурсы.Записывать = Истина;
	Для Каждого ТекСтрокаРесурсы Из Персонал Цикл
		Движение = Движения.ПлановыеЦеныНаРесурсы.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Сценарий = Сценарий;
		Движение.Ресурс = ТекСтрокаРесурсы.Ресурс;
		Движение.СтатьяЗатрат = ТекСтрокаРесурсы.СтатьяЗатрат;
		Движение.Цена = ТекСтрокаРесурсы.Цена;
		Движение.ЦенаПрошлогоПериода = ТекСтрокаРесурсы.ЦенаПрошлогоПериода;
		Движение.ЦенаПрошлогоПериодаСоСтатьей103 = ТекСтрокаРесурсы.ЦенаПрошлогоПериодаСоСтатьей103;
		Движение.ЦенаПрошлогоПериодаСоцПакет = ТекСтрокаРесурсы.ЦенаПрошлогоПериодаСоцПакет;
	КонецЦикла;
	Для Каждого ТекСтрокаРесурсы Из Инструменты Цикл
		Движение = Движения.ПлановыеЦеныНаРесурсы.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Сценарий = Сценарий;
		Движение.Ресурс = ТекСтрокаРесурсы.Ресурс;
		Движение.Цена = ТекСтрокаРесурсы.Цена;
		Движение.ЦенаПрошлогоПериода = ТекСтрокаРесурсы.ЦенаПрошлогоПериода;
		Движение.ЦенаПрошлогоПериодаСоСтатьей103 = ТекСтрокаРесурсы.ЦенаПрошлогоПериодаСоСтатьей103;
		Движение.ЦенаПрошлогоПериодаСоцПакет = ТекСтрокаРесурсы.ЦенаПрошлогоПериодаСоцПакет;
	КонецЦикла;
	Для Каждого ТекСтрокаРесурсы Из Материалы Цикл
		Движение = Движения.ПлановыеЦеныНаРесурсы.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Сценарий = Сценарий;
		Движение.Ресурс = ТекСтрокаРесурсы.Ресурс;
		Движение.Цена = ТекСтрокаРесурсы.Цена;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ Константы.УчетПоОрганизациям.Получить() И Не ЗначениеЗаполнено(Организация) Тогда 
		Организация = Константы.ОрганизацияПоУмолчанию.Получить();
	КонецЕсли;
КонецПроцедуры


