
&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	ТабличныеЧастиКЛАДОКлиент.РассчитатьСуммыВСтрокеТЧ(Элементы.Материалы.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	ТабличныеЧастиКЛАДОКлиент.РассчитатьСуммыВСтрокеТЧ(Элементы.Материалы.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСуммаПриИзменении(Элемент)
	ТабличныеЧастиКЛАДОКлиент.РассчитатьЦенуВСтрокеТЧ(Элементы.Материалы.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли; 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПодбораНоменклатуры", ЭтотОбъект); 
	
	ПараметрыПодбора = Новый Структура("Договор", Объект.Договор);
	ОткрытьФорму("Документ.ЗаявкаНаЗакуп.Форма.ПодборМатериалов", ПараметрыПодбора, ЭтотОбъект, УникальныйИдентификатор, , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодбораНоменклатуры(РезультатПодбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатПодбора = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Для каждого Материал Из РезультатПодбора Цикл
		
		НайденныеСтроки = Объект.Материалы.НайтиСтроки(Новый Структура("Материал", Материал));
		
		Если НайденныеСтроки.Количество() Тогда
			Продолжить;
		КонецЕсли;
		
		Объект.Материалы.Добавить().Материал = Материал;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры
 
#Область ПодключаемыеКоманды 

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

#КонецОбласти