
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область ОбновлениеВерсииИБ

// Определяет настройки начального заполнения элементов.
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт

	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;

КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
// 
// Параметры:
//   КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//   Элементы - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//   ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВыходныеИПраздничныеДни";
	Элемент.Наименование = НСтр("ru='В'");
	Элемент.ПолноеНаименование = НСтр("ru='Выходные и праздничные дни'");
	Элемент.Код = "01";
	
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НеявкиРазрешенныеЗаконом";
	Элемент.Наименование = НСтр("ru='Г'");
	Элемент.ПолноеНаименование = НСтр("ru='Неявки, разрешенные законом (выполнение государственных обязанностей и др.)'");
	Элемент.Код = "02";
	
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СлужебныеКоммандировки";
	Элемент.Наименование = НСтр("ru='К'");
	Элемент.ПолноеНаименование = НСтр("ru='Служебные коммандировки'");
	Элемент.Код = "03";
	
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ЕжегодныйТрудовойОтпуск";
	Элемент.Наименование = НСтр("ru='О'");
	Элемент.ПолноеНаименование = НСтр("ru='Ежегодный трудовой отпуск'");
	Элемент.Код = "04";
	
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОтпускССохранениемЗаработнойПлаты";
	Элемент.Наименование = НСтр("ru='С'");
	Элемент.ПолноеНаименование = НСтр("ru='Отпуск с сохранением заработной платы, по условиям коллективного договора'");
	Элемент.Код = "05";
	
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОтпускБезСохраненияЗаработнойПлаты";
	Элемент.Наименование = НСтр("ru='А'");
	Элемент.ПолноеНаименование = НСтр("ru='Отпуск без сохранения заработной платы (неявки с разрешения администрации)'");
	Элемент.Код = "06";
	
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "УчебныйОтпуск";
	Элемент.Наименование = НСтр("ru='У'");
	Элемент.ПолноеНаименование = НСтр("ru='Учебный отпуск'");
	Элемент.Код = "07";
	
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОтпускВСвязиСРождениемРебенка";
	Элемент.Наименование = НСтр("ru='Р'");
	Элемент.ПолноеНаименование = НСтр("ru='Отпуск в связи с рождением ребенка (детей), усыновлением (удочерением) новорожденного ребенка (детей)'");
	Элемент.Код = "08";
	
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Нетрудоспособность";
	Элемент.Наименование = НСтр("ru='Б'");
	Элемент.ПолноеНаименование = НСтр("ru='Нетрудоспособность (болезнь, карантин и т.п.) '");
	Элемент.Код = "09";
	
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ЛьготныеЧасыПодростков";
	Элемент.Наименование = НСтр("ru='Л'");
	Элемент.ПолноеНаименование = НСтр("ru='Льготные часы подростков до 18 лет'");
	Элемент.Код = "10";
	
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПерерывыДляКормленияРебенка";
	Элемент.Наименование = НСтр("ru='М'");
	Элемент.ПолноеНаименование = НСтр("ru='Перерывы для кормления ребенка (детей), работающим женщинам, имеющим детей в возрасте до полутора лет'");
	Элемент.Код = "11";
	
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Прогул";
	Элемент.Наименование = НСтр("ru='П'");
	Элемент.ПолноеНаименование = НСтр("ru='Прогул'");
	Элемент.Код = "12";
	
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Неявка";
	Элемент.Наименование = НСтр("ru='Н'");
	Элемент.ПолноеНаименование = НСтр("ru='Неявки, опоздания и преждевременный уход'");
	Элемент.Код = "13";
	
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НевыходНаРаботуДоПриемаИПослеУвольнения";
	Элемент.Наименование = НСтр("ru='Д'");
	Элемент.ПолноеНаименование = НСтр("ru='Невыход на работу до приема и после увольнения'");
	Элемент.Код = "14";
	
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВыполнениеСлужебныхПорученийВнеТерритории";
	Элемент.Наименование = НСтр("ru='Т'");
	Элемент.ПолноеНаименование = НСтр("ru='Выполнение служебных поручений вне территории, обслуживаемой данным табелем'");
	Элемент.Код = "15";
	
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Простой";
	Элемент.Наименование = НСтр("ru='Ч'");
	Элемент.ПолноеНаименование = НСтр("ru='Простой (внутрисменный, целосменный)'");
	Элемент.Код = "16";
	
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПереводВДругоеПодразделение";
	Элемент.Наименование = НСтр("ru='Х'");
	Элемент.ПолноеНаименование = НСтр("ru='Перевод (перемещение) работников в другое подразделение до перевода и после возвращения в свое подразделение (на свое рабочее место)'");
	Элемент.Код = "17";
	
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПричиныОтсутствия.Ссылка КАК Ссылка,
	|	ПричиныОтсутствия.ПолноеНаименование КАК ПолноеНаименование,
	|	ПричиныОтсутствия.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ПричиныОтсутствия КАК ПричиныОтсутствия";
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	ШаблонПредставления = "%1 (%2)";
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		НовыйЭлементВыбора = ДанныеВыбора.Добавить();
		НовыйЭлементВыбора.Значение = РезультатЗапроса.Ссылка;
		НовыйЭлементВыбора.Представление = СтрШаблон(ШаблонПредставления, РезультатЗапроса.Наименование,
			РезультатЗапроса.ПолноеНаименование);
		
	КонецЦикла;  
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти 

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти