Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Организация = Константы.ОрганизацияПоУмолчанию.Получить();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.НачисленияИзУчетнойСистемы.Записывать = Истина;
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Движение = Движения.НачисленияИзУчетнойСистемы.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ПодразделениеОрганизации = ТекСтрокаНачисления.Подразделение;
		Движение.СтатьяЗатрат = ТекСтрокаНачисления.СтатьяЗатрат;
		Движение.Контрагент = ТекСтрокаНачисления.Контрагент;
		Движение.ДоговорИзУчетнойСистемы = ТекСтрокаНачисления.ДоговорКонтрагента;
		Движение.НоменклатурнаяГруппа = ТекСтрокаНачисления.НоменклатурнаяГруппа;
		Движение.Сумма = ТекСтрокаНачисления.Сумма;
	КонецЦикла;

КонецПроцедуры
