

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ПараметрыОтбора = Новый Структура("ТипКлиента", ПредопределенноеЗначение("Перечисление.ТипКлиента.Партнер"));
	
	Форма = ОткрытьФорму("Справочник.Контрагенты.ФормаСписка",
	Новый Структура("Отбор", ПараметрыОтбора),
		ПараметрыВыполненияКоманды.Источник,
		Новый УникальныйИдентификатор,
		ПараметрыВыполненияКоманды.Окно);
	Форма.АвтоЗаголовок  = ЛожЬ;
	Форма.Заголовок = "Контрагенты (Партнеры)";

КонецПроцедуры

#КонецОбласти

