
&НаКлиенте
Процедура ОК(Команда)
	НастройкиЗаполнения = Новый Структура;
	НастройкиЗаполнения.Вставить("КоличествоДней",КоличествоДней);
	НастройкиЗаполнения.Вставить("КоличествоЧасов",КоличествоЧасов);
	НастройкиЗаполнения.Вставить("НачальнаяДата",НачальнаяДата);
	НастройкиЗаполнения.Вставить("ВладелецФормы",ВладелецФормы);
	НастройкиЗаполнения.Вставить("СУчетомВыходных",СУчетомВыходных);
	Оповестить("ИнструментыВыбраныНастройкиПоДням",НастройкиЗаполнения);
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СУчетомВыходных = Параметры.СУчетомВыходных;
КонецПроцедуры
