#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Организация) Тогда 
		Организация = Константы.ОрганизацияПоУмолчанию.Получить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ФактическиеЦеныНаРесурсы.Записывать = Истина;
	
	Для Каждого ТекСтрокаРесурсы Из Персонал Цикл
		Движение = Движения.ФактическиеЦеныНаРесурсы.Добавить();
		Движение.Период       = Дата;
		Движение.Организация  = Организация;
		Движение.Сценарий     = Сценарий;
		Движение.Ресурс       = ТекСтрокаРесурсы.Ресурс;
		Движение.СтатьяЗатрат = ТекСтрокаРесурсы.СтатьяЗатрат;
		Движение.Цена         = ТекСтрокаРесурсы.Цена;
	КонецЦикла;
	
	Для Каждого ТекСтрокаРесурсы Из Инструменты Цикл
		Движение = Движения.ФактическиеЦеныНаРесурсы.Добавить();
		Движение.Период       = Дата;
		Движение.Организация  = Организация;
		Движение.Сценарий     = Сценарий;
		Движение.Ресурс       = ТекСтрокаРесурсы.Ресурс;
		Движение.Цена         = ТекСтрокаРесурсы.Цена;
		Движение.СтатьяЗатрат = ТекСтрокаРесурсы.СтатьяЗатрат;
	КонецЦикла;
	
	Для Каждого ТекСтрокаРесурсы Из Материалы Цикл
		Движение = Движения.ФактическиеЦеныНаРесурсы.Добавить();
		Движение.Период      = Дата;
		Движение.Организация = Организация;
		Движение.Сценарий    = Сценарий;
		Движение.Ресурс      = ТекСтрокаРесурсы.Ресурс;
		Движение.Цена        = ТекСтрокаРесурсы.Цена;
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не Константы.УчетПоОрганизациям.Получить() И Не ЗначениеЗаполнено(Организация) Тогда 
		Организация = Константы.ОрганизацияПоУмолчанию.Получить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти