&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Если Параметры.Свойство("Организация") Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокДерево, "Владелец", Параметры.Организация);
	//Иначе
	//	ОрганизацияПоУмолчанию = КЛАДОСлужебныйПовтИсп.ОрганизацияПоУмолчанию();
	//	Если ЗначениеЗаполнено(ОрганизацияПоУмолчанию) Тогда
	//		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец", ОрганизацияПоУмолчанию);
	//		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокДерево, "Владелец", ОрганизацияПоУмолчанию);
	//	КонецЕсли;
	//КонецЕсли;
	ДобавитьОтборыПоПараметрамСеанса();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьОтборыПоПараметрамСеанса" Тогда
		ДобавитьОтборыПоПараметрамСеанса();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокДеревоПриАктивизацииСтроки(Элемент)
	//ТекущиеДанные = Элементы.СписокДерево.ТекущаяСтрока;
	//Если ТекущиеДанные = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//////////////////////////////////START Кибернетика//////////////////////////////////////////
	////Автор: Кочетков П.А.
	////Дата: 13.09.2021 11:07:29
	////Задача: I-5876
	//// -------- Исходный код:
	////ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Родитель", ТекущиеДанные);
	//// -------- заменён на:
	//Если ТипЗнч(ТекущиеДанные) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
	//		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Родитель", ТекущиеДанные.Ключ);
	//	Иначе
	//		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Родитель", ТекущиеДанные);
	//КонецЕсли; 
	////////////////////////////////FINISH Кибернетика///////////////////////////////////////
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьОтборыПоПараметрамСеанса()
	
	КЛАДО_ОбщийМодульСервер.ДобавитьОтборыПоПараметрамСеанса(Список, Новый ПолеКомпоновкиДанных("Владелец"), ПараметрыСеанса.ОрганизацияОтбор, ЗначениеЗаполнено(ПараметрыСеанса.ОрганизацияОтбор));
	КЛАДО_ОбщийМодульСервер.ДобавитьОтборыПоПараметрамСеанса(СписокДерево, Новый ПолеКомпоновкиДанных("Владелец"), ПараметрыСеанса.ОрганизацияОтбор, ЗначениеЗаполнено(ПараметрыСеанса.ОрганизацияОтбор));
	
КонецПроцедуры

#КонецОбласти