
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТЗ = ПолучитьИзВременногоХранилища(Параметры.АдресТЗ);
	Оплаты.Загрузить(ТЗ);
	
	ПолноправныйПольователь = Пользователи.РолиДоступны("КЛадо_Администрирование, КЛАДО_РедактировниеНачисленийИОплатДоговоров", Пользователи.ТекущийПользователь());
	Элементы.ФормаПеренестиВДокумент.Доступность = ПолноправныйПольователь;
	Элементы.Оплаты.ТолькоПросмотр =  НЕ ПолноправныйПольователь;

	Если ИспользованиеПометкиУдаления() Тогда
		Элементы.ОплатыПометкаУдаления.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьАдресТЗ()
	ТЗ = Оплаты.Выгрузить(); 
	//ТЗ.Свернуть("Период", "СуммаПоДоговору");
	Возврат ПоместитьВоВременноеХранилище(ТЗ);
КонецФункции

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	Результат = СформироватьАдресТЗ();
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура ОплатыПриИзменении(Элемент)
	СуммаИтог = Оплаты.Итог("СуммаПоДоговору");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИспользованиеПометкиУдаления()
	Возврат Константы.ИспользоватьПометкуУдаленияВСтрокахТаблицДоговоров.Получить()
КонецФункции

&НаКлиенте
Процедура ОплатыПередУдалением(Элемент, Отказ)
Если ИспользованиеПометкиУдаления() Тогда 
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
