
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Пользователь = Пользователи.ТекущийПользователь();
	Объект = Параметры.Объект;
	тзИзмененияРеквизитов = ПолучитьИзВременногоХранилища(Параметры.АдресХранилища);
	ИзмененияРеквизитов.Загрузить(тзИзмененияРеквизитов);
КонецПроцедуры

&НаСервере
Функция ПоместитьИзмененияВХранилище(Знач ИзмененияРеквизитов)
	Возврат ПоместитьВоВременноеХранилище(ИзмененияРеквизитов.Выгрузить(), УникальныйИдентификатор);
КонецФункции

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	//ПричинаЗаполнены = Истина;
	//Для Каждого Стр ИЗ ИзмененияРеквизитов Цикл
	//	Если СокрЛП(Стр.Причина) = "" Тогда
	//		ПричинаЗаполнены = Ложь;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	//Если НЕ ПричинаЗаполнены Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить причины изменения реквизитов!");
	//	Возврат;
	//КонецЕсли;
	//ВидПричинаЗаполнен = Истина;
	//Для Каждого Стр ИЗ ИзмененияРеквизитов Цикл
	//	Если Стр.НазваниеРеквизита = "ДатаОкончания" 
	//		И Не ЗначениеЗаполнено(Стр.ВидПричины) Тогда
	//		ВидПричинаЗаполнен = Ложь;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	//Если НЕ ВидПричинаЗаполнен Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить вид причины изменения срока для даты окончания!");
	//	Возврат;
	//КонецЕсли;
	Закрыть(ПоместитьИзмененияВХранилище(ИзмененияРеквизитов));
КонецПроцедуры
