
&НаКлиенте
Процедура ПересчитатьЦены(Команда)
	ПересчитатьЦеныНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьЦеныНаСервере()
	
	Для Каждого Договор Из СписокДоговоров Цикл
		
		ДогОб = Договор.Значение.ПолучитьОбъект();
		
		Для Каждого Стр Из ДогОб.Материалы Цикл
			Стр.Цена = ПолучитьЦенуНаРесурс(ДогОб.Организация, ДогОб.Сценарий, Стр.Материал, Неопределено, ДогОб.ДатаОкончания);
			Стр.Сумма = Стр.Цена * Стр.Количество;
		КонецЦикла;
		
		Для Каждого Стр Из ДогОб.Персонал Цикл
			КоличествоЧасов = ?(Стр.Цена=0,0,Стр.Сумма / Стр.Цена);
			Стр.Цена	= ПолучитьЦенуНаРесурс(ДогОб.Организация, ДогОб.Сценарий, Стр.Должность, Стр.СтатьяЗатрат, ДогОб.ДатаОкончания);
			Стр.ЦенаПрошлогоПериода	= ПолучитьЦенуНаРесурс(ДогОб.Организация, ДогОб.Сценарий, Стр.Должность, Стр.СтатьяЗатрат, ДогОб.ДатаОкончания,"ЦенаПрошлогоПериода");
			Стр.ЦенаПрошлогоПериодаСоСтатьей103	= ПолучитьЦенуНаРесурс(ДогОб.Организация, ДогОб.Сценарий, Стр.Должность, Стр.СтатьяЗатрат, ДогОб.ДатаОкончания,"ЦенаПрошлогоПериодаСоСтатьей103");
			Стр.ЦенаПрошлогоПериодаСоцПакет	= ПолучитьЦенуНаРесурс(ДогОб.Организация, ДогОб.Сценарий, Стр.Должность, Стр.СтатьяЗатрат, ДогОб.ДатаОкончания,"ЦенаПрошлогоПериодаСоцПакет");
			Стр.Сумма = Стр.Цена * КоличествоЧасов;
			Стр.СуммаПрошлогоПериода = Стр.ЦенаПрошлогоПериода * КоличествоЧасов;
			Стр.СуммаПрошлогоПериодаСоСтатьей103 = Стр.ЦенаПрошлогоПериодаСоСтатьей103 * КоличествоЧасов;
			Стр.СуммаПрошлогоПериодаСоцПакет = Стр.ЦенаПрошлогоПериодаСоцПакет * КоличествоЧасов;
		КонецЦикла;
		
		Для Каждого Стр Из ДогОб.Инструменты Цикл
			Стр.Цена	= ПолучитьЦенуНаРесурс(ДогОб.Организация, ДогОб.Сценарий, Стр.Инструмент,Неопределено, ДогОб.ДатаОкончания);
			Стр.ЦенаПрошлогоПериода	= ПолучитьЦенуНаРесурс(ДогОб.Организация, ДогОб.Сценарий, Стр.Инструмент, Неопределено, ДогОб.ДатаОкончания,"ЦенаПрошлогоПериода");
			Стр.ЦенаПрошлогоПериодаСоСтатьей103	= ПолучитьЦенуНаРесурс(ДогОб.Организация, ДогОб.Сценарий, Стр.Инструмент, Неопределено, ДогОб.ДатаОкончания,"ЦенаПрошлогоПериодаСоСтатьей103");
			Стр.ЦенаПрошлогоПериодаСоцПакет	= ПолучитьЦенуНаРесурс(ДогОб.Организация, ДогОб.Сценарий, Стр.Инструмент, Неопределено, ДогОб.ДатаОкончания,"ЦенаПрошлогоПериодаСоцПакет");
			Стр.Сумма = Стр.Цена * Стр.КоличествоЧасов;
			Стр.СуммаПрошлогоПериода = Стр.ЦенаПрошлогоПериода * Стр.КоличествоЧасов;
			Стр.СуммаПрошлогоПериодаСоСтатьей103 = Стр.ЦенаПрошлогоПериодаСоСтатьей103 * Стр.КоличествоЧасов;
			Стр.СуммаПрошлогоПериодаСоцПакет = Стр.ЦенаПрошлогоПериодаСоцПакет * Стр.КоличествоЧасов;
		КонецЦикла;
		
		ДогОб.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуНаРесурс(Организация, Сценарий, Ресурс, СтатьяЗатрат, ДатаРасчета = Неопределено, ВидЦеныПерсонала = "Цена")  
	
	Если Не ЗначениеЗаполнено(ДатаРасчета) Тогда 
		ДатаРасчета = ТекущаяДата();	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПлановыеЦеныНаРесурсыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ПлановыеЦеныНаРесурсы.СрезПоследних(
		|			&ДатаРасчета,
		|			Организация = &Организация
		|				И Ресурс = &Ресурс
		|				И Сценарий = &Сценарий
		|				И (СтатьяЗатрат = &СтатьяЗатрат
		|					ИЛИ &СтатьяЗатрат = НЕОПРЕДЕЛЕНО)) КАК ПлановыеЦеныНаРесурсыСрезПоследних";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,".Цена","."+ВидЦеныПерсонала);
	
	Запрос.УстановитьПараметр("ДатаРасчета",	ДатаРасчета);
	Запрос.УстановитьПараметр("Организация",	Организация);
	Если ТипЗнч(Ресурс) = Тип("СправочникСсылка.Персонал") Тогда 
		Запрос.УстановитьПараметр("Ресурс",		Ресурс.Должность);
	Иначе 
		Запрос.УстановитьПараметр("Ресурс",		Ресурс);
	КонецЕсли;
	Запрос.УстановитьПараметр("Сценарий",		Сценарий);
	Запрос.УстановитьПараметр("СтатьяЗатрат",	СтатьяЗатрат);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Цена
	КонецЦикла;
	
	Возврат 0

КонецФункции

