
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Наименование = Строка(Объект.Организация) + "-" + Строка(Объект.СтатьяЗатрат) 
					+ ?(ЗначениеЗаполнено(Объект.ПодразделениеОрганизации),  "-" + Строка(Объект.ПодразделениеОрганизации), "")
					+ ?(ЗначениеЗаполнено(Объект.Контрагент),  "-" + Строка(Объект.Контрагент), "")
					+ ?(ЗначениеЗаполнено(Объект.ДоговорИзУчетнойСистемы),  "-" + Строка(Объект.ДоговорИзУчетнойСистемы), "")
					+ ?(ЗначениеЗаполнено(Объект.НоменклатурнаяГруппа),  "-" + Строка(Объект.НоменклатурнаяГруппа), "") ;
КонецПроцедуры
