
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьСтатьюЗатрат(Договор)
	Возврат Договор.СтатьяЗатрат;
КонецФункции


&НаКлиенте
Процедура ДоговораДоговорПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Договора.ТекущиеДанные;
	ТекущиеДанные.СтатьяЗатрат = ПолучитьСтатьюЗатрат(ТекущиеДанные.Договор);
	ТекущиеДанные.Коэффициент = 1;
КонецПроцедуры


&НаКлиенте
Процедура ДоговораПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Для Каждого СтрокаТек Из ПараметрыПеретаскивания.Значение Цикл
		НоваяСтрока = Объект.Договора.Добавить();
		НоваяСтрока.Договор = СтрокаТек;
		НоваяСтрока.СтатьяЗатрат = ПолучитьСтатьюЗатрат(СтрокаТек);
		НоваяСтрока.Коэффициент = 1;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ПереместитьВлево(Команда)
	ВыбранныеСтроки = Элементы.ДСДоговоры.ВыделенныеСтроки;
	Если ВыбранныеСтроки.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	Для Каждого СтрокаТек Из ВыбранныеСтроки Цикл
		НоваяСтрока = Объект.Договора.Добавить();
		НоваяСтрока.Договор = СтрокаТек;
		НоваяСтрока.СтатьяЗатрат = ПолучитьСтатьюЗатрат(СтрокаТек);
		НоваяСтрока.Коэффициент = 1;
	КонецЦикла;
	ЕстьИзмененияПравила = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьСумму(Команда)
	ОчиститьСообщения();
	Если Не ЗначениеЗаполнено(СуммаРаспределения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма распределения не заполнена!");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Период) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Период распределения не заполнен!");
		Возврат;
	КонецЕсли;
	КоэффициентыИтог = Объект.Договора.Итог("Коэффициент");
	Если КоэффициентыИтог = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Коэффициенты распределения не заполнены!");
		Возврат;
	КонецЕсли;
	РаспределитьСуммуНаСервере(КоэффициентыИтог);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма распределена по договорам.");
КонецПроцедуры

&НаСервере
Процедура РаспределитьСуммуНаСервере(КоэффициентыИтог)
	Распределено = 0;
	КоличествоСтрок = Объект.Договора.Количество()-1;
	Для ин = 0 по КоличествоСтрок Цикл
		СтрокаДоговор = Объект.Договора[ин];
		ДоговорОб = СтрокаДоговор.Договор.ПолучитьОбъект();
		СуммаРаспределенная = Окр(СтрокаДоговор.Коэффициент / КоэффициентыИтог * СуммаРаспределения);
		Если РежимРаспределения = 0 Тогда
			НоваяСтрока = ДоговорОб.Оплаты.Добавить();
			НоваяСтрока.Период = Период;
			НоваяСтрока.СтатьяЗатрат = СтрокаДоговор.СтатьяЗатрат;
			НоваяСтрока.СуммаНачисления = СуммаРаспределенная;
			Распределено = Распределено +  НоваяСтрока.СуммаНачисления;
			Если ин = КоличествоСтрок тогда
				НоваяСтрока.СуммаНачисления = НоваяСтрока.СуммаНачисления + (СуммаРаспределения - Распределено);
			КонецЕсли;
		ИначеЕсли РежимРаспределения = 1 Тогда
			ДоговорОб.СуммаПлан =  ДоговорОб.СуммаПлан + СуммаРаспределенная;
			Распределено = Распределено +  СуммаРаспределенная;
			Если ин = КоличествоСтрок тогда
				ДоговорОб.СуммаПлан =  ДоговорОб.СуммаПлан + (СуммаРаспределения - Распределено);
			КонецЕсли;
		ИначеЕсли РежимРаспределения = 2 Тогда
			//ДоговорОб.СуммаПоДоговору =  ДоговорОб.СуммаПоДоговору + СуммаРаспределенная;
			НоваяСтрока = ДоговорОб.СуммыПоДоговоруПоПериоду.Добавить();
			НоваяСтрока.Период = Период;
			НоваяСтрока.СуммаПоДоговору = СуммаРаспределенная;
			Распределено = Распределено +  СуммаРаспределенная;
			Если ин = КоличествоСтрок тогда
				НоваяСтрока.СуммаПоДоговору = НоваяСтрока.СуммаПоДоговору + (СуммаРаспределения - Распределено);
			КонецЕсли;
		КонецЕсли;
		ДоговорОб.Записать();
	КонецЦикла;
	
КонецПроцедуры



