
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	УстановитьОтборыПоУмолчанию();
	
КонецПроцедуры
 
&НаСервере
Процедура УстановитьОтборыПоУмолчанию()	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Автор", Пользователи.ТекущийПользователь(),
		ВидСравненияКомпоновкиДанных.Равно, "Только мои документы", Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		
	УстановитьОтборПоПериоду();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = Период;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораПериода", ЭтотОбъект); 	
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПериода(ВыбранныйПериод, ДополнительныеПараметры) Экспорт
	
	Период.ДатаНачала = ВыбранныйПериод.ДатаНачала;
	Период.ДатаОкончания = ВыбранныйПериод.ДатаОкончания;
	
	УстановитьОтборПоПериоду();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоПериоду()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Дата", Период.ДатаНачала, 
		ВидСравненияКомпоновкиДанных.Больше, , ЗначениеЗаполнено(Период.ДатаНачала));
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Дата", Период.ДатаОкончания, 
		ВидСравненияКомпоновкиДанных.Меньше, , ЗначениеЗаполнено(Период.ДатаОкончания));
	
КонецПроцедуры
 
 
