#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаРесурсы") Тогда
		Документы.ОбеспечениеРесурсами.ЗаполнитьПоОснованию(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ЗаявкиНаРесурсы 
	Движения.ЗаявкиНаРесурсы.Записывать = Истина;
	Движения.ЗаявкиНаРесурсыДС.Записывать = Истина;
	Для Каждого ТекСтрокаПерсонал Из Персонал Цикл
		Движение = Движения.ЗаявкиНаРесурсы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Проект = Проект;
		Движение.Договор = Договор;
		Движение.Задача = Задача;
		Движение.Ресурс = ТекСтрокаПерсонал.Должность;
		Движение.Количество = 0;
		Движение.КоличествоСтавок = ТекСтрокаПерсонал.КоличествоСтавок;
		Движение.КоличествоЧасов = ТекСтрокаПерсонал.КоличествоЧасов;
	КонецЦикла;

	Для Каждого ТекСтрока Из Инструменты Цикл
		Движение = Движения.ЗаявкиНаРесурсы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Проект = Проект;
		Движение.Договор = Договор;
		Движение.Задача = Задача;
		Движение.Ресурс = ТекСтрока.Инструмент;
		Движение.Количество = 0;
		Движение.КоличествоСтавок = 0;
		Движение.КоличествоЧасов = ТекСтрока.КоличествоЧасов;
	КонецЦикла;

	Для Каждого ТекСтрока Из Материалы Цикл
		Движение = Движения.ЗаявкиНаРесурсы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Проект = Проект;
		Движение.Договор = Договор;
		Движение.Задача = Задача;
		Движение.Ресурс = ТекСтрока.Материал;
		Движение.Количество = ТекСтрока.Количество;
		Движение.КоличествоСтавок = 0;
		Движение.КоличествоЧасов = 0;
	КонецЦикла;

	// регистр ЗаявкиНаРесурсыДС 
	Для Каждого ТекСтрокаДеньги Из Деньги Цикл
		Движение = Движения.ЗаявкиНаРесурсыДС.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Проект = Проект;
		Движение.Договор = Договор;
		Движение.КонтрагентЗаявки = ТекСтрокаДеньги.Контрагент;
		Движение.ДоговорЗаявки = ТекСтрокаДеньги.Договор;
		Движение.Задача = Задача;
		Движение.Сумма = ТекСтрокаДеньги.Сумма;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
