
&НаКлиенте
Процедура Загрузить(Команда)
	
	МассивРесурсов = Новый Массив;
	
	НомерСтроки = 1;
	
	Пока ЗначениеЗаполнено(ТабДок.Область("R" + НомерСтроки + "C1").Текст) ИЛИ ЗначениеЗаполнено(ТабДок.Область("R" + НомерСтроки + "C2").Текст) Цикл
		СтруктураРесурса = Новый Структура;
		СтруктураРесурса.Вставить("Ресурс", 	ТабДок.Область("R" + НомерСтроки + "C1").Текст);
		СтруктураРесурса.Вставить("Код", 		ТабДок.Область("R" + НомерСтроки + "C2").Текст);
		СтруктураРесурса.Вставить("Цена",		СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТабДок.Область("R" + НомерСтроки + "C3").Текст));
		МассивРесурсов.Добавить(СтруктураРесурса);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("УникальныйИдентификаторФормыДокумента", УникальныйИдентификаторФормыДокумента);
	ПараметрыОповещения.Вставить("НазваниеТаблицы", НазваниеТаблицы);
	ПараметрыОповещения.Вставить("МассивРесурсов",	МассивРесурсов);
	
	Оповестить("ЗагрузкаПлановыхЦенНаРесурсы", ПараметрыОповещения);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры
