
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ПереносСрокаЗадачи") Тогда
		ЗаполнитьЗначенияСвойств(Запись, Параметры, "Адресат, Объект, НазваниеРеквизита, Пользователь");
		Массив = Новый Массив(); 
		Массив.Добавить(Тип("Дата")); 
		НашеОписание = Новый ОписаниеТипов(Массив,,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата));

		Элементы.Значение.ОграничениеТипа = НашеОписание; 
		Запись.Значение = НашеОписание.ПривестиЗначение(Запись.Значение); 
	КонецЕсли;
	Запись.Период = ТекущаяДатаСеанса();
КонецПроцедуры
