
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ФактическоеИспользованиеРесурсов.Записывать = Истина;
	
	МатериалыСвернутая = Материалы.Выгрузить();
	МатериалыСвернутая.Свернуть("Договор, СтатьяЗатрат, Продукт", "Сумма");
	
	ИнструментыСвернутая = Инструменты.Выгрузить();
	ИнструментыСвернутая.Свернуть("Договор, СтатьяЗатрат, Продукт", "Сумма");

	ПерсоналСвернутая = Персонал.Выгрузить();
	ПерсоналСвернутая.Свернуть("Договор, СтатьяЗатрат, Продукт", "Сумма");
	
	УслугиСвернутая = Услуги.Выгрузить();
	УслугиСвернутая.Свернуть("ДоговорДоходный, СтатьяЗатрат, Продукт", "Сумма");
	УслугиСвернутая.Колонки.ДоговорДоходный.Имя = "Договор";
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИнструментыСвернутая, МатериалыСвернутая);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ПерсоналСвернутая, МатериалыСвернутая);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(УслугиСвернутая, МатериалыСвернутая);
	
	Для Каждого ТекСтрокаМатериал Из МатериалыСвернутая Цикл
		Если ЗначениеЗаполнено(ТекСтрокаМатериал.Договор) Тогда 
			
			Движение = Движения.ФактическоеИспользованиеРесурсов.Добавить();
			Движение.Период = Дата;
			Движение.Договор = ТекСтрокаМатериал.Договор;
			Движение.СтатьяЗатрат = ТекСтрокаМатериал.СтатьяЗатрат;
			Движение.Сумма = ТекСтрокаМатериал.Сумма;
			
		ИначеЕсли ЗначениеЗаполнено(ТекСтрокаМатериал.Продукт) Тогда 
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Договоры.Ссылка КАК Ссылка,
			|	Договоры.СуммаПоДоговору КАК СуммаПлан
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	Справочник.Договоры КАК Договоры
			|ГДЕ
			|	Договоры.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.ДТ1)
			|	И Договоры.Проект.Продукт = &Продукт
			|	И НЕ Договоры.ПометкаУдаления
			|	И Договоры.СостояниеИсполнения = &СостояниеИсполнения
			|	И Договоры.Сценарий = &Сценарий
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(ВТ.СуммаПлан) КАК СуммаПлан
			|ПОМЕСТИТЬ ВТ_Сумма
			|ИЗ
			|	ВТ КАК ВТ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ.Ссылка КАК Ссылка,
			|	ВЫБОР
			|		КОГДА ВТ_Сумма.СуммаПлан <> 0
			|			ТОГДА ВТ.СуммаПлан / ВТ_Сумма.СуммаПлан
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Коэффициент
			|ИЗ
			|	ВТ КАК ВТ,
			|	ВТ_Сумма КАК ВТ_Сумма";
			
			Запрос.УстановитьПараметр("Продукт", ТекСтрокаМатериал.Продукт);
			Запрос.УстановитьПараметр("СостояниеИсполнения", Статус);
			Запрос.УстановитьПараметр("Сценарий", Сценарий); 
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Движение = Движения.ФактическоеИспользованиеРесурсов.Добавить();
				Движение.Период = Дата;
				Движение.Договор = ВыборкаДетальныеЗаписи.Ссылка;
				Движение.СтатьяЗатрат = ТекСтрокаМатериал.СтатьяЗатрат;
				Движение.Сумма = ТекСтрокаМатериал.Сумма*ВыборкаДетальныеЗаписи.Коэффициент;
			КонецЦикла;
			
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Договоры.Ссылка КАК Ссылка,
			//|	Договоры.СуммаПлан КАК СуммаПлан
			|	Договоры.СуммаПоДоговору КАК СуммаПлан
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	Справочник.Договоры КАК Договоры
			|ГДЕ
			|	Договоры.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.ДТ1)
			|	И НЕ Договоры.ПометкаУдаления
			|	И Договоры.СостояниеИсполнения = &СостояниеИсполнения
			|	И Договоры.Сценарий = &Сценарий
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(ВТ.СуммаПлан) КАК СуммаПлан
			|ПОМЕСТИТЬ ВТ_Сумма
			|ИЗ
			|	ВТ КАК ВТ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ.Ссылка КАК Ссылка,
			|	ВЫБОР
			|		КОГДА ВТ_Сумма.СуммаПлан <> 0
			|			ТОГДА ВТ.СуммаПлан / ВТ_Сумма.СуммаПлан
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Коэффициент
			|ИЗ
			|	ВТ КАК ВТ,
			|	ВТ_Сумма КАК ВТ_Сумма";
			
			Запрос.УстановитьПараметр("СостояниеИсполнения", Статус);
			Запрос.УстановитьПараметр("Сценарий", Сценарий); 
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Движение = Движения.ФактическоеИспользованиеРесурсов.Добавить();
				Движение.Период = Дата;
				Движение.Договор = ВыборкаДетальныеЗаписи.Ссылка;
				Движение.СтатьяЗатрат = ТекСтрокаМатериал.СтатьяЗатрат;
				Движение.Сумма = ТекСтрокаМатериал.Сумма*ВыборкаДетальныеЗаписи.Коэффициент;
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор = Пользователи.ТекущийПользователь();
	
	УстановитьПривилегированныйРежим(Истина);
	Сценарий = Константы.СценарийПоУмолчанию.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
