
#Область СлужебныеПроцедурыИФункции

Функция СтавкаНДСОрганизации(Организация = Неопределено, ПериоД = Неопределено) Экспорт
	
	Если Организация = Неопределено Тогда
		Организация = ОрганизацияПоУмолчанию();
	КонецЕсли;
	Если ПериоД = Неопределено Тогда
		ПериоД = Дата(1,1,1);
	КонецЕсли;
	Выборка = РегистрыСведений.СтавкиНДС.Выбрать(,Период, Новый Структура("Организация", Организация));;
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ставка
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

Функция ОрганизацияПоУмолчанию() Экспорт
	
	Возврат Константы.ОрганизацияПоУмолчанию.Получить();
	
КонецФункции

Функция ТекущийСотрудник() Экспорт
	
	Возврат Пользователи.ТекущийПользователь().Сотрудник;
	
КонецФункции

#КонецОбласти
