
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Проекты, "Продукт", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Неопределено));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СтратегическиеЦели, "Продукт", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Неопределено));
	Договоры.Параметры.УстановитьЗначениеПараметра("Продукт", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Проекты, "Продукт", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Неопределено));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СтратегическиеЦели, "Продукт", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Неопределено));
КонецПроцедуры

&НаКлиенте
Процедура СтратегическиеЦелиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, ВыбраннаяСтрока.Ключ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроектыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, ВыбраннаяСтрока.Ключ);
	КонецЕсли;
КонецПроцедуры

//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	
//	// СтандартныеПодсистемы.Свойства
//	ДополнительныеПараметры = Новый Структура;
//	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "СтраницаДополнительныеРеквизиты");
//	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
//	// Конец СтандартныеПодсистемы.Свойства
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	// СтандартныеПодсистемы.Свойства
//	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
//	// Конец СтандартныеПодсистемы.Свойства
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
//	// СтандартныеПодсистемы.Свойства
//	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
//		ОбновитьЭлементыДополнительныхРеквизитов();
//		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
//	КонецЕсли;
//	// Конец СтандартныеПодсистемы.Свойства
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПриЧтенииНаСервере(ТекущийОбъект)
//	
//	// СтандартныеПодсистемы.Свойства
//	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
//	// Конец СтандартныеПодсистемы.Свойства
//	
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
//	// СтандартныеПодсистемы.Свойства
//	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
//	// Конец СтандартныеПодсистемы.Свойства
//КонецПроцедуры

//&НаСервере
//Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
//	// СтандартныеПодсистемы.Свойства
//	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
//	// Конец СтандартныеПодсистемы.Свойства
//КонецПроцедуры


//#Область ОбработчикиКомандФормы

//// СтандартныеПодсистемы.Свойства

//&НаКлиенте
//Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
//	
//	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
//	
//КонецПроцедуры

//// Конец СтандартныеПодсистемы.Свойства

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

//// СтандартныеПодсистемы.Свойства

//&НаСервере
//Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
//	УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
//	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
//КонецПроцедуры

//&НаКлиенте
//Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
//	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
//КонецПроцедуры

//&НаСервере
//Процедура ОбновитьЭлементыДополнительныхРеквизитов()
//	
//	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
//	
//КонецПроцедуры

//// Конец СтандартныеПодсистемы.Свойства
//#КонецОбласти
