
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Договоры") тогда
		Отбор = Новый Структура("Договор", ПараметрКоманды);
	Иначе
		Отбор = Новый Структура("ДоговорИзУчетнойСистемы", ПараметрКоманды);
	КонецЕсли;
	ОткрытьФорму("РегистрСведений.СоответствиеДоговоров.ФормаСписка", Новый Структура("Отбор", Отбор), ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
