
Процедура ПриЗаписи(Отказ)
	//Если ДополнительныеСвойства.Свойство("ИзмененРуководитель") Тогда
	//	
	//	ТекРук = Руководитель.ПолучитьОбъект();
	//	ТекРук.Родитель = Справочники.Сотрудники.ПустаяСсылка();
	//	ТекРук.Подразделение = Ссылка;
	//	ТекРук.Записать();
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	Сотрудники.Ссылка КАК Ссылка
	//	               |ИЗ
	//	               |	Справочник.Сотрудники КАК Сотрудники
	//	               |ГДЕ
	//	               |	Сотрудники.Родитель <> &Руководитель
	//				   |	И НЕ Сотрудники.Ссылка <> &Руководитель
	//	               |	И Сотрудники.Подразделение = &Подразделение";
	//	Запрос.УстановитьПараметр("Руководитель", Руководитель);
	//	Запрос.УстановитьПараметр("Подразделение", Ссылка);
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	
	//	Пока Выборка.Следующий() Цикл
	//		ТекОб = Выборка.Ссылка.ПолучитьОбъект();
	//		ТекОб.Родитель = Руководитель;
	//		ТекОб.Записать();
	//	КонецЦикла;
	//КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	//Если Ссылка.Руководитель <> Руководитель Тогда
	//	ДополнительныеСвойства.Вставить("ИзмененРуководитель", Ссылка.Руководитель);
	//КонецЕсли;
КонецПроцедуры
