
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура();
	//Сотрудник = ПолучитьТекущегоСотрудника();
	//Если ЗначениеЗаполнено(Сотрудник) Тогда
	//	ПараметрыФормы.Вставить("Администратор", Сотрудник);
	//КонецЕсли;
	ОткрытьФорму("Справочник.Задачи.Форма.ЗадачиСотрудника", Новый Структура("Отбор", ПараметрыФормы), ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
