
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр РаспределенияЗатратПоДоговорамУС 
	Движения.РаспределенияЗатратПоДоговорамУС.Записывать = Истина;
	Для Каждого ТекСтрокаЗатраты Из Затраты Цикл
		Движение = Движения.РаспределенияЗатратПоДоговорамУС.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Договор = Договор;
		Движение.ДоговорДохода = ТекСтрокаЗатраты.ДоговорДохода;
		Движение.СтатьяЗатрат = СтатьяЗатрат;
		Движение.СуммаЗатрат = СуммаЗатрат;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Организация = Константы.ОрганизацияПоУмолчанию.Получить();
КонецПроцедуры
