
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Период = ТекущаяДатаСеанса();
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("КоличествоЧасов") Тогда
		НоваяЗаписьРегистра						= РегистрыСведений.ИсторияИзменения.СоздатьМенеджерЗаписи();
		НоваяЗаписьРегистра.Период				= ТекущаяДата();
		НоваяЗаписьРегистра.Объект				= ЭтотОбъект.Отбор.Задача.Значение;
		НоваяЗаписьРегистра.НазваниеРеквизита	= "Удаление списания времени на задачи";
		НоваяЗаписьРегистра.Пользователь		= Пользователи.ТекущийПользователь();
		НоваяЗаписьРегистра.Значение			= Формат(ЭтотОбъект.ДополнительныеСвойства.КоличествоЧасов,"ДФ=ЧЧ:мм:сс");
		НоваяЗаписьРегистра.Записать();
	КонецЕсли;
	
	Для Каждого ЗаписьРегистра Из ЭтотОбъект Цикл 
		НоваяЗаписьРегистра						= РегистрыСведений.ИсторияИзменения.СоздатьМенеджерЗаписи();
		НоваяЗаписьРегистра.Период				= ТекущаяДата();
		НоваяЗаписьРегистра.Объект				= ЗаписьРегистра.Задача;
		НоваяЗаписьРегистра.НазваниеРеквизита	= "Списание времени на задачи";
		НоваяЗаписьРегистра.Пользователь		= Пользователи.ТекущийПользователь();
		НоваяЗаписьРегистра.Значение			= Формат(ЗаписьРегистра.Время,"ДФ=ЧЧ:мм:сс");
		НоваяЗаписьРегистра.Записать();
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЭтотОбъект.Количество() = 0 Тогда //Удаление записи
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеВремениНаЗадачи.Время КАК Время
		|ИЗ
		|	РегистрСведений.СписаниеВремениНаЗадачи КАК СписаниеВремениНаЗадачи
		|ГДЕ
		|	СписаниеВремениНаЗадачи.Период = &Период
		|	И СписаниеВремениНаЗадачи.Задача = &Задача
		|	И СписаниеВремениНаЗадачи.Сотрудник = &Сотрудник";
		
		Запрос.УстановитьПараметр("Задача", ЭтотОбъект.Отбор.Задача.Значение);
		Запрос.УстановитьПараметр("Период", ЭтотОбъект.Отбор.Период.Значение);
		Запрос.УстановитьПараметр("Сотрудник", ЭтотОбъект.Отбор.Сотрудник.Значение);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЭтотОбъект.ДополнительныеСвойства.Вставить("КоличествоЧасов", ВыборкаДетальныеЗаписи.Время);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
