Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Организация = Константы.ОрганизацияПоУмолчанию.Получить();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ЗатратыИзУчетнойСистемы.Записывать = Истина;
	Для Каждого ТекСтрокаЗатраты Из Затраты Цикл
		Движение = Движения.ЗатратыИзУчетнойСистемы.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ПодразделениеОрганизации = ТекСтрокаЗатраты.Подразделение;
		Движение.СтатьяЗатрат = ТекСтрокаЗатраты.СтатьяЗатрат;
		Движение.Контрагент = ТекСтрокаЗатраты.Контрагент;
		Движение.ДоговорИзУчетнойСистемы = ТекСтрокаЗатраты.ДоговорКонтрагента;
		Движение.НоменклатурнаяГруппа = ТекСтрокаЗатраты.НоменклатурнаяГруппа;
		Движение.СуммаЗатрат = ТекСтрокаЗатраты.СуммаЗатрат;
	КонецЦикла;

КонецПроцедуры
