
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура(?(ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Организации"), "Организация", "Подразделение"), ПараметрКоманды));
	ОткрытьФорму("Справочник.Сотрудники.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
