// Пересчитывает суммы в строке ТЧ
//
// Параметры:
//  СтрокаТабличнойЧасти - ДанныеФормыСтруктура	 - Данные строки таблицы формы
//
Процедура РассчитатьСуммыВСтрокеТЧ(СтрокаТабличнойЧасти) Экспорт
	
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
	
КонецПроцедуры

Процедура РассчитатьЦенуВСтрокеТЧ(СтрокаТабличнойЧасти) Экспорт
	
	Если Не СтрокаТабличнойЧасти.Количество = 0 Тогда
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
	Иначе
		СтрокаТабличнойЧасти.Цена = 0;
	КонецЕсли; 
	
КонецПроцедуры
 
