
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Отбор =  Новый Структура("Объект.Владелец", ПараметрКоманды);
	//ПараметрыФормы = Новый Структура("Отбор", Отбор);
	Форма = ОткрытьФорму("РегистрСведений.ИсторияИзменения.ФормаСписка", , ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.Список, "Объект.Владелец", ПараметрКоманды);	
КонецПроцедуры

