///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// См. УправлениеСвойствамиПереопределяемый.ЗаполнитьНаборыСвойствОбъекта.
//
Процедура ЗаполнитьНаборыСвойствОбъекта(Объект, ТипСсылки, НаборыСвойств, СтандартнаяОбработка, КлючНазначения) Экспорт
	
	
КонецПроцедуры

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
// 
// Параметры:
//  Наборы -см.УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.Наборы
//
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	// Наборы справочника Демо: Номенклатура
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_Продукты";
	Набор.ЭтоГруппа = Истина;
	Набор.Идентификатор = Новый УникальныйИдентификатор("c4a2f656-d8a8-11eb-b8bc-0242ac130003");
	
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_Подразделения";
	Набор.ЭтоГруппа = Истина;
	Набор.Идентификатор = Новый УникальныйИдентификатор("d3a34d90-d8a8-11eb-b8bc-0242ac130003");
	
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_Договоры";
	Набор.ЭтоГруппа = Истина;
	Набор.Идентификатор = Новый УникальныйИдентификатор("c265b5f2-d8aa-11eb-b8bc-0242ac130003");
	
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_Должности";
	Набор.ЭтоГруппа = Истина;
	Набор.Идентификатор = Новый УникальныйИдентификатор("c8e122e0-d8aa-11eb-b8bc-0242ac130003");
	
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_Задачи";
	Набор.ЭтоГруппа = Истина;
	Набор.Идентификатор = Новый УникальныйИдентификатор("d44ef706-d8aa-11eb-b8bc-0242ac130003 ");
	
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_Контрагенты";
	Набор.ЭтоГруппа = Истина;
	Набор.Идентификатор = Новый УникальныйИдентификатор("db273f02-d8aa-11eb-b8bc-0242ac130003");
	
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_Материалы";
	Набор.ЭтоГруппа = Истина;
	Набор.Идентификатор = Новый УникальныйИдентификатор("16f1840c-64ba-4bc5-bd39-621092c1adee");
	
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_Организации";
	Набор.ЭтоГруппа = Истина;
	Набор.Идентификатор = Новый УникальныйИдентификатор("f77901ea-d8aa-11eb-b8bc-0242ac130003");
	
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_Проекты";
	Набор.ЭтоГруппа = Истина;
	Набор.Идентификатор = Новый УникальныйИдентификатор("9ffd6eb7-0184-4f37-a1d0-40752e1e5661");
	
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_СтратегическиеЦели";
	Набор.ЭтоГруппа = Истина;
	Набор.Идентификатор = Новый УникальныйИдентификатор("e94498af-166a-4dd9-be4a-a0a379a5e700");
	
КонецПроцедуры

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииНаименованийНаборовСвойств.
//
Процедура ПриПолученииНаименованийНаборовСвойств(Наименования, КодЯзыка) Экспорт
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры и функции.

#КонецОбласти
