
Процедура ПриЗаписи(Отказ)
	
	// Начало Изменение реквизитов
	Если Константы.ИспользоватьЛогирование.Получить()  Тогда
		ЕстьЗаписиВРегистреИзменения = ИзменениеРеквизитовСервер.ЕстьЗаписиВРегистреИзменения(Ссылка);
		Если Не ЕстьЗаписиВРегистреИзменения Тогда
			ИзменениеРеквизитовСервер.ЗаписатьИзмененныеРеквизиты(ЭтотОбъект, Истина);
		КонецЕсли;
		Если НЕ (ДополнительныеСвойства.Свойство("ИзмененияОбработаны")
			И ДополнительныеСвойства.ИзмененияОбработаны) 
			И ЕстьЗаписиВРегистреИзменения Тогда
			ИзменениеРеквизитовСервер.ЗаписатьИзмененныеРеквизиты(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	// Конец Изменение реквизитов
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТекущийСотрудник = Пользователи.ТекущийПользователь().Сотрудник;
	Инициатор = ТекущийСотрудник;
	Если Не ЗначениеЗаполнено(Организация) Тогда 
		Организация = Константы.ОрганизацияПоУмолчанию.Получить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ Константы.УчетПоОрганизациям.Получить() И Не ЗначениеЗаполнено(Организация) Тогда 
		Организация = Константы.ОрганизацияПоУмолчанию.Получить();
	КонецЕсли;
	
КонецПроцедуры
