Процедура ОбменСКУФИБЗарегистрироватьИзменениеДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("ОбменСКУФИБ", Источник, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура ОбменСКУФИБЗарегистрироватьИзменение(Источник, Отказ) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("ОбменСКУФИБ", Источник, Отказ);
КонецПроцедуры

Процедура ОбменСКУФИБЗарегистрироватьИзменениеНабораЗаписей(Источник, Отказ, Замещение) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра("ОбменСКУФИБ", Источник, Отказ, Замещение);
КонецПроцедуры

Процедура ОбменСКУФИБЗарегистрироватьУдаление(Источник, Отказ) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("ОбменСКУФИБ", Источник, Отказ);
КонецПроцедуры