
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)	
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("СправочникСсылка.Договоры") Тогда
		ЗаполнитьНаОснованииДоговора(ДанныеЗаполнения);
	КонецЕсли; 
	
	Автор = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииДоговора(ДанныеЗаполнения)
	
	Договор = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ПланЗакупаМатериалов.Записывать = Истина;	
	
	Для каждого СтрокаМатериал Из Материалы Цикл		
		ЗаписьПланЗакупа = Движения.ПланЗакупаМатериалов.Добавить();
		ЗаписьПланЗакупа.Период = Дата;
		ЗаполнитьЗначенияСвойств(ЗаписьПланЗакупа, СтрокаМатериал); 		
	КонецЦикла; 
	
КонецПроцедуры
 
