
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ФактическоеИспользованиеРесурсов.Записывать = Истина;
	
	ПерсоналСвернутая = Персонал.Выгрузить();
	ПерсоналСвернутая.Свернуть("Договор, СтатьяЗатрат", "Сумма");
	
	Для Каждого ТекСтрокаПерсонал Из ПерсоналСвернутая Цикл
		Движение = Движения.ФактическоеИспользованиеРесурсов.Добавить();
		Движение.Период = Дата;
		Движение.Договор = ТекСтрокаПерсонал.Договор;
		Движение.СтатьяЗатрат = ТекСтрокаПерсонал.СтатьяЗатрат;
		Движение.Сумма = ТекСтрокаПерсонал.Сумма;
	КонецЦикла;
	
	МатериалыСвернутая = Материалы.Выгрузить();
	МатериалыСвернутая.Свернуть("Договор, СтатьяЗатрат, Продукт, Подразделение", "Сумма");
	
	Для Каждого ТекСтрокаМатериал Из МатериалыСвернутая Цикл
		Если ЗначениеЗаполнено(ТекСтрокаМатериал.Договор) Тогда 
			
			Движение = Движения.ФактическоеИспользованиеРесурсов.Добавить();
			Движение.Период = Дата;
			Движение.Договор = ТекСтрокаМатериал.Договор;
			Движение.СтатьяЗатрат = ТекСтрокаМатериал.СтатьяЗатрат;
			Движение.Сумма = ТекСтрокаМатериал.Сумма;
			
		ИначеЕсли ЗначениеЗаполнено(ТекСтрокаМатериал.Продукт) Тогда 
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Договоры.Ссылка КАК Ссылка,
			|	Договоры.СуммаПоДоговору КАК СуммаПлан
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	Справочник.Договоры КАК Договоры
			|ГДЕ
			|	Договоры.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.ДТ1)
			|	И Договоры.Проект.Продукт = &Продукт
			|	И НЕ Договоры.ПометкаУдаления
			|	И Договоры.СостояниеИсполнения = &СостояниеИсполнения
			|	И Договоры.Сценарий = &Сценарий
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(ВТ.СуммаПлан) КАК СуммаПлан
			|ПОМЕСТИТЬ ВТ_Сумма
			|ИЗ
			|	ВТ КАК ВТ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ.Ссылка КАК Ссылка,
			|	ВЫБОР
			|		КОГДА ВТ_Сумма.СуммаПлан <> 0
			|			ТОГДА ВТ.СуммаПлан / ВТ_Сумма.СуммаПлан
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Коэффициент
			|ИЗ
			|	ВТ КАК ВТ,
			|	ВТ_Сумма КАК ВТ_Сумма";
			
			Запрос.УстановитьПараметр("Продукт", ТекСтрокаМатериал.Продукт);
			Запрос.УстановитьПараметр("СостояниеИсполнения", Статус);
			Запрос.УстановитьПараметр("Сценарий", Сценарий); 
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Движение = Движения.ФактическоеИспользованиеРесурсов.Добавить();
				Движение.Период = Дата;
				Движение.Договор = ВыборкаДетальныеЗаписи.Ссылка;
				Движение.СтатьяЗатрат = ТекСтрокаМатериал.СтатьяЗатрат;
				Движение.Сумма = ТекСтрокаМатериал.Сумма*ВыборкаДетальныеЗаписи.Коэффициент;
			КонецЦикла;
			
		//ИначеЕсли ЗначениеЗаполнено(ТекСтрокаМатериал.Подразделение) Тогда 
		//	
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = 
		//	"ВЫБРАТЬ
		//	|	Договоры.Ссылка КАК Ссылка,
		//	|	Договоры.СуммаПоДоговору КАК СуммаПлан
		//	|ПОМЕСТИТЬ ВТ_Договоры
		//	|ИЗ
		//	|	Справочник.Договоры.Подразделения КАК ДоговорыПодразделения
		//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
		//	|		ПО ДоговорыПодразделения.Ссылка = Договоры.Ссылка
		//	|ГДЕ
		//	|	Договоры.ПометкаУдаления = ЛОЖЬ
		//	|	И Договоры.ТипДоговора = &ТипДоговора
		//	|	И Договоры.СостояниеИсполнения = &СостояниеИсполнения
		//	|	И ДоговорыПодразделения.Подразделение = &Подразделение
		//	|	И ДоговорыПодразделения.Сценарий = &Сценарий
		//	|;
		//	|
		//	|////////////////////////////////////////////////////////////////////////////////
		//	|ВЫБРАТЬ
		//	|	СУММА(ВТ_Договоры.СуммаПлан) КАК Сумма
		//	|ПОМЕСТИТЬ ВТ_ПлановаяСумма
		//	|ИЗ
		//	|	ВТ_Договоры КАК ВТ_Договоры
		//	|;
		//	|
		//	|////////////////////////////////////////////////////////////////////////////////
		//	|ВЫБРАТЬ
		//	|	ВТ_Договоры.Ссылка КАК Договор,
		//	|	ВЫБОР
		//	|		КОГДА ВТ_ПлановаяСумма.Сумма <> 0
		//	|			ТОГДА ВТ_Договоры.СуммаПлан / ВТ_ПлановаяСумма.Сумма
		//	|		ИНАЧЕ 0
		//	|	КОНЕЦ КАК Коэффициент
		//	|ИЗ
		//	|	ВТ_Договоры КАК ВТ_Договоры,
		//	|	ВТ_ПлановаяСумма КАК ВТ_ПлановаяСумма";
		//	Запрос.УстановитьПараметр("Подразделение", ТекСтрокаМатериал.Подразделение); 
		//	Запрос.УстановитьПараметр("ТипДоговора", Перечисления.ТипыДоговоров.ДТ1);
		//	Запрос.УстановитьПараметр("СостояниеИсполнения", Статус);
		//	Запрос.УстановитьПараметр("Сценарий", Сценарий); 
		//	РезультатЗапроса = Запрос.Выполнить().Выбрать();
		//				
		//	Пока РезультатЗапроса.Следующий() Цикл				
		//		Движение = Движения.ФактическоеИспользованиеРесурсов.Добавить();
		//		
		//		Движение.Период= Дата;
		//		Движение.Договор = РезультатЗапроса.Договор;
		//		Движение.СтатьяЗатрат = ТекСтрокаМатериал.СтатьяЗатрат;
		//		Движение.Сумма = ТекСтрокаМатериал.Сумма * РезультатЗапроса.Коэффициент;
		//		Движение.ЗаполненПоСвязаннымДоговорам = Истина;
		//	КонецЦикла; 			 
			
		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Договоры.Ссылка КАК Ссылка,
			|	Договоры.СуммаПоДоговору КАК СуммаПлан
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	Справочник.Договоры КАК Договоры
			|ГДЕ
			|	Договоры.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.ДТ1)
			|	И НЕ Договоры.ПометкаУдаления
			|	И Договоры.СостояниеИсполнения = &СостояниеИсполнения
			|	И Договоры.Сценарий = &Сценарий
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(ВТ.СуммаПлан) КАК СуммаПлан
			|ПОМЕСТИТЬ ВТ_Сумма
			|ИЗ
			|	ВТ КАК ВТ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ.Ссылка КАК Ссылка,
			|	ВЫБОР
			|		КОГДА ВТ_Сумма.СуммаПлан <> 0
			|			ТОГДА ВТ.СуммаПлан / ВТ_Сумма.СуммаПлан
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Коэффициент
			|ИЗ
			|	ВТ КАК ВТ,
			|	ВТ_Сумма КАК ВТ_Сумма";
			
			Запрос.УстановитьПараметр("Сценарий", Сценарий); 
			Запрос.УстановитьПараметр("СостояниеИсполнения", Статус);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Движение = Движения.ФактическоеИспользованиеРесурсов.Добавить();
				Движение.Период = Дата;
				Движение.Договор = ВыборкаДетальныеЗаписи.Ссылка;
				Движение.СтатьяЗатрат = ТекСтрокаМатериал.СтатьяЗатрат;
				Движение.Сумма = ТекСтрокаМатериал.Сумма*ВыборкаДетальныеЗаписи.Коэффициент;
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
