// Заполняет структуру данных для открытия формы выбора календаря
// 
// Параметры:
// 	ДатаКалендаряПриОткрытии - Дата - .
// 	ЗакрыватьПриВыборе - Булево - .
// 	МножественныйВыбор - Булево - .
// Возвращаемое значение:
// 	Структура - .
Функция ПараметрыОткрытияФормыКалендаря(ДатаКалендаряПриОткрытии, ЗакрыватьПриВыборе = Истина,
	МножественныйВыбор = Ложь) Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ДатаКалендаря", ДатаКалендаряПриОткрытии);
	Результат.Вставить("ЗакрыватьПриВыборе", ЗакрыватьПриВыборе);
	Результат.Вставить("МножественныйВыбор", МножественныйВыбор);
	
	Возврат Результат;

КонецФункции