
Процедура ПередЗаписью(Отказ, Замещение)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	Для Каждого Запись Из ЭтотОбъект Цикл
		//создаем задачу адресату
		НоваяЗадача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
		//НоваяЗадача.БизнесПроцесс = ЭтотОбъект.Ссылка;
		//НоваяЗадача.ТочкаМаршрута = БизнесПроцессы.Согласование.ТочкиМаршрута.ОпределитьСписокРецензентов;
		НоваяЗадача.Дата = ТекущаяДатаСеанса();
		НоваяЗадача.Наименование = "Изменение даты окончания задачи";
		НоваяЗадача.Автор = Запись.Пользователь;
		НоваяЗадача.АвторСтрокой = Строка(Запись.Пользователь);
		НоваяЗадача.Исполнитель = Запись.Адресат;
		НоваяЗадача.Важность = Перечисления.ВариантыВажностиЗадачи.Высокая;
		НоваяЗадача.Предмет = Запись.Объект;
		НоваяЗадача.ПредметСтрокой = Строка(Запись.Объект);
		
		ТекстОписание = СтрШаблон("Задача: %1
								|Пользователь %2 отправил запрос на изменение даты окончания задачи на %3
								|по причине: %4.",
								НоваяЗадача.ПредметСтрокой,
								Строка(Запись.Пользователь),
								Формат(Запись.Значение, "ДФ=dd.MM.yyyy"),
								Запись.Причина);
		НоваяЗадача.Описание = ТекстОписание;
		НоваяЗадача.НаименованиеРеквизита = Запись.НазваниеРеквизита;
		НоваяЗадача.ДатаНачала = Запись.Период;
		НоваяЗадача.ВидЗадачи = Перечисления.видыЗадач.Согласование;
		НоваяЗадача.Записать();

	КонецЦикла;
КонецПроцедуры