///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// Конец СтандартныеПодсистемы
	
	Если ИменаПараметровСеанса = Неопределено Тогда
		ПараметрыСеанса.СотрудникОтбор		= Справочники.Сотрудники.ПустаяСсылка();
		ПараметрыСеанса.ПодразделениеОтбор	= Справочники.Подразделения.ПустаяСсылка();
		ПараметрыСеанса.ОрганизацияОтбор	= Справочники.Организации.ПустаяСсылка();
		ПараметрыСеанса.СтатусОтбор			= 0;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли