
Процедура ПриЗаписи(Отказ)
	// Начало Изменение реквизитов
	Если Константы.ИспользоватьЛогирование.Получить()  Тогда
		ЕстьЗаписиВРегистреИзменения = ИзменениеРеквизитовСервер.ЕстьЗаписиВРегистреИзменения(Ссылка);
		Если Не ЕстьЗаписиВРегистреИзменения Тогда
			ИзменениеРеквизитовСервер.ЗаписатьИзмененныеРеквизиты(ЭтотОбъект, Истина);
		КонецЕсли;
		Если НЕ (ДополнительныеСвойства.Свойство("ИзмененияОбработаны")
			И ДополнительныеСвойства.ИзмененияОбработаны) 
			И ЕстьЗаписиВРегистреИзменения Тогда
			ИзменениеРеквизитовСервер.ЗаписатьИзмененныеРеквизиты(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	// Конец Изменение реквизитов
	
КонецПроцедуры
