
&НаКлиенте
Процедура Распределить(Команда)
	РаспределитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура РаспределитьНаСервере()
	
	Для Каждого Договор Из СписокДоговоров Цикл
		
		ДогОб = Договор.Значение.ПолучитьОбъект();	
		
		Для Каждого Стр Из ДогОб.Распределения Цикл
			Если Стр.Договор.СостояниеИсполнения = Перечисления.СтатусыДоговоровПроектов.Планируемый Тогда 
				Стр.СуммаРаспределения = Стр.Договор.СуммаПлан;
			Иначе
				Стр.СуммаРаспределения = 0;
			КонецЕсли;
		КонецЦикла;
		
		СуммаРаспределения = ДогОб.СуммаПлан;
		СуммаРаспределенияПоДоговору = ДогОб.СуммаПоДоговору;
		СуммаИтог = ДогОб.Распределения.Итог("СуммаРаспределения");
		КоэффициентыИтог = 100;
		Если СуммаИтог = 0 Тогда
			Продолжить;;
		КонецЕсли;
		Для Каждого СтрокаРаспределения ИЗ ДогОб.Распределения Цикл
			СтрокаРаспределения.Коэффициент = Окр(СтрокаРаспределения.СуммаРаспределения / СуммаИтог * КоэффициентыИтог, 3);
			СтрокаРаспределения.Сумма = Окр(СтрокаРаспределения.СуммаРаспределения / СуммаИтог* СуммаРаспределения, 2);
			СтрокаРаспределения.СуммаДоговора = Окр(СтрокаРаспределения.СуммаРаспределения / СуммаИтог* СуммаРаспределенияПоДоговору, 2);
		КонецЦикла;
		
		ДогОб.записать();
		
	КонецЦикла;
	
КонецПроцедуры
