
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Сотрудники, "Должность", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Неопределено));
КонецПроцедуры

&НаКлиенте
Процедура Сотрудники1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Сотрудники1.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	ПоказатьЗначение(, ТекущиеДанные.Сотрудник);
КонецПроцедуры
