
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("МассивСсылок") Тогда
		ТекТаблица = ЭтаФорма[Параметры.ТипСсылок];
		Для Каждого Эл Из Параметры.МассивСсылок Цикл                   
			Стр = ТекТаблица.Добавить();
			Стр.Объект = Эл;
		КонецЦикла;
	КонецЕсли;
	
	ОбновитьОтображениеТаблиц();
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеТаблиц()
	
	Если СписокЗадач.Количество() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Задачи.Ссылка КАК Объект,
		               |	Задачи.Администратор КАК Администратор,
		               |	Задачи.Инициатор КАК Инициатор
		               |ИЗ
		               |	Справочник.Задачи КАК Задачи
					   |ГДЕ Задачи.Ссылка В (&Задачи)";
		Запрос.УстановитьПараметр("Задачи", СписокЗадач.Выгрузить().ВыгрузитьКолонку("Объект"));
		СписокЗадач.Загрузить(Запрос.Выполнить().Выгрузить());
	КонецЕсли;
	
	Если СписокДоговоров.Количество() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Договоры.Ссылка КАК Объект,
		               |	Договоры.Администратор КАК Администратор,
		               |	Договоры.Инициатор КАК Инициатор
		               |ИЗ
		               |	Справочник.Договоры КАК Договоры
		               |ГДЕ
		               |	Договоры.Ссылка В(&Договоры)";
		Запрос.УстановитьПараметр("Договоры", СписокДоговоров.Выгрузить().ВыгрузитьКолонку("Объект"));
		СписокДоговоров.Загрузить(Запрос.Выполнить().Выгрузить());
	КонецЕсли;
	
	Если СписокПроектов.Количество() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Проекты.Ссылка КАК Объект,
		               |	Проекты.Администратор КАК Администратор,
		               |	Проекты.Инициатор КАК Инициатор
		               |ИЗ
		               |	Справочник.Проекты КАК Проекты
		               |ГДЕ
		               |	Проекты.Ссылка В(&Проекты)";
		Запрос.УстановитьПараметр("Проекты", СписокПроектов.Выгрузить().ВыгрузитьКолонку("Объект"));
		СписокПроектов.Загрузить(Запрос.Выполнить().Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗадачиПоДоговорамНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Задачи.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Задачи КАК Задачи
	               |ГДЕ
	               |	Задачи.Владелец В (&Договоры)";
	Запрос.УстановитьПараметр("Договоры", СписокДоговоров.Выгрузить().ВыгрузитьКолонку("Объект"));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Стр = СписокЗадач.Добавить();
		Стр.Объект = Выборка.Ссылка;
	КонецЦикла;
	ОбновитьОтображениеТаблиц();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗадачиПоДоговорам(Команда)
	СписокЗадач.Очистить();
	ЗаполнитьЗадачиПоДоговорамНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоговорыПоПроектамНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Договоры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Договоры КАК Договоры
	               |ГДЕ
	               |	Договоры.Проект В (&Проекты)";
	Запрос.УстановитьПараметр("Проекты", СписокПроектов.Выгрузить().ВыгрузитьКолонку("Объект"));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Стр = СписокДоговоров.Добавить();
		Стр.Объект = Выборка.Ссылка;
	КонецЦикла;
	ОбновитьОтображениеТаблиц();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДоговорыПоПроектам(Команда)
	СписокДоговоров.Очистить();
	ЗаполнитьДоговорыПоПроектамНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИзменитьРеквизитыНаСервере()
	Для Каждого Стр ИЗ СписокПроектов Цикл
		ТекОбъект = Стр.Объект.ПолучитьОбъект();
		Если ЗначениеЗаполнено(НовыйАдминистратор) Тогда
			ТекОбъект.Администратор = НовыйАдминистратор;
		КонецЕсли;
		Если ЗначениеЗаполнено(НовыйИнициатор) Тогда
			ТекОбъект.Инициатор = НовыйИнициатор;
		КонецЕсли;
		ТекОбъект.Записать();
	КонецЦикла;
	Для Каждого Стр ИЗ СписокДоговоров Цикл
		ТекОбъект = Стр.Объект.ПолучитьОбъект();
		Если ЗначениеЗаполнено(НовыйАдминистратор) Тогда
			ТекОбъект.Администратор = НовыйАдминистратор;
		КонецЕсли;
		Если ЗначениеЗаполнено(НовыйИнициатор) Тогда
			ТекОбъект.Инициатор = НовыйИнициатор;
		КонецЕсли;
		ТекОбъект.Записать();
	КонецЦикла;
	Для Каждого Стр ИЗ СписокЗадач Цикл
		ТекОбъект = Стр.Объект.ПолучитьОбъект();
		Если ЗначениеЗаполнено(НовыйАдминистратор) Тогда
			ТекОбъект.Администратор = НовыйАдминистратор;
		КонецЕсли;
		Если ЗначениеЗаполнено(НовыйИнициатор) Тогда
			ТекОбъект.Инициатор = НовыйИнициатор;
		КонецЕсли;
		ТекОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура мИзменитьРеквизиты(Команда)
	ИзменитьРеквизитыНаСервере();
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Реквизиты изменены.");
	ОбновитьОтображениеТаблиц();
КонецПроцедуры

&НаСервере
Функция ПолучитьРеквизитыОбъекта(СсылкаНаОбъект)
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, "Инициатор, Администратор");
КонецФункции

&НаКлиенте
Процедура СписокОбъектовОбъектПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокПроектов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ПолучитьРеквизитыОбъекта(ТекущиеДанные.Объект));
КонецПроцедуры

&НаКлиенте
Процедура СписокДоговоровОбъектПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокПроектов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ПолучитьРеквизитыОбъекта(ТекущиеДанные.Объект));
КонецПроцедуры

&НаКлиенте
Процедура СписокЗадачПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокПроектов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ПолучитьРеквизитыОбъекта(ТекущиеДанные.Объект));
КонецПроцедуры
