
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("КодовоеНаименование");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
    
    Если Данные.КодовоеНаименование = ПредопределенноеЗначение("Перечисление.УровниClado.РезультатыПервогоУровня") Тогда 
        Вид = "Р1 - ";
    ИначеЕсли Данные.КодовоеНаименование = ПредопределенноеЗначение("Перечисление.УровниClado.РезультатВторогоУровня") Тогда 
        Вид = "Р2 - ";
    ИначеЕсли Данные.КодовоеНаименование = ПредопределенноеЗначение("Перечисление.УровниClado.ГруппаРезультатовВторогоУровня") Тогда 
        Вид = "ГР2 - ";
    ИначеЕсли Данные.КодовоеНаименование = ПредопределенноеЗначение("Перечисление.УровниClado.ПодгруппаРезультатовВторогоУровня") Тогда 
        Вид = "ПГР2 - ";
    Иначе 
        Вид = "";
	КонецЕсли;
	
	Представление = Вид + Данные.Наименование;
	
КонецПроцедуры
