
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СотрудникОтбор		= ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Обработка.НачальнаяСтраница", "СотрудникОтбор", ,,ПользователиИнформационнойБазы.ТекущийПользователь().Имя); 
	ПодразделениеОтбор	= ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Обработка.НачальнаяСтраница", "ПодразделениеОтбор", ,,ПользователиИнформационнойБазы.ТекущийПользователь().Имя); 
	ОрганизацияОтбор	= ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Обработка.НачальнаяСтраница", "ОрганизацияОтбор", ,,ПользователиИнформационнойБазы.ТекущийПользователь().Имя); 
	СтатусОтбор			= ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Обработка.НачальнаяСтраница", "СтатусОтбор", ,,ПользователиИнформационнойБазы.ТекущийПользователь().Имя); 
	
	Если ЗначениеЗаполнено(СотрудникОтбор) Тогда
		ПараметрыСеанса.СотрудникОтбор = СотрудникОтбор;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПодразделениеОтбор) Тогда
		ПараметрыСеанса.ПодразделениеОтбор = ПодразделениеОтбор;
	КонецЕсли;
	Если ЗначениеЗаполнено(ОрганизацияОтбор) Тогда
		ПараметрыСеанса.ОрганизацияОтбор = ОрганизацияОтбор;
	КонецЕсли;
	ПараметрыСеанса.СтатусОтбор = СтатусОтбор;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(СотрудникОтбор) 
		ИЛИ ЗначениеЗаполнено(ПодразделениеОтбор)
		ИЛИ ЗначениеЗаполнено(ОрганизацияОтбор)
		ИЛИ ЗначениеЗаполнено(СтатусОтбор)Тогда
		Оповестить("ОбновитьОтборыПоПараметрамСеанса");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура СотрудникОтборПриИзменении(Элемент)
	СотрудникОтборПриИзмененииНаСервере();
	Оповестить("ОбновитьОтборыПоПараметрамСеанса");
КонецПроцедуры

&НаСервере
Процедура СотрудникОтборПриИзмененииНаСервере()
	ПараметрыСеанса.СотрудникОтбор = СотрудникОтбор;
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Обработка.НачальнаяСтраница", "СотрудникОтбор", СотрудникОтбор,,ПользователиИнформационнойБазы.ТекущийПользователь().Имя); 
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеОтборПриИзменении(Элемент)
	ПодразделениеОтборПриИзмененииНаСервере();
	Оповестить("ОбновитьОтборыПоПараметрамСеанса");
КонецПроцедуры

&НаСервере
Процедура ПодразделениеОтборПриИзмененииНаСервере()
	ПараметрыСеанса.ПодразделениеОтбор = ПодразделениеОтбор;
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Обработка.НачальнаяСтраница", "ПодразделениеОтбор", ПодразделениеОтбор,,ПользователиИнформационнойБазы.ТекущийПользователь().Имя); 
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОтборПриИзменении(Элемент)
	ОрганизацияОтборПриИзмененииНаСервере();
	Оповестить("ОбновитьОтборыПоПараметрамСеанса");
КонецПроцедуры

&НаСервере
Процедура ОрганизацияОтборПриИзмененииНаСервере()
	ПараметрыСеанса.ОрганизацияОтбор = ОрганизацияОтбор;
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Обработка.НачальнаяСтраница", "ОрганизацияОтбор", ОрганизацияОтбор,,ПользователиИнформационнойБазы.ТекущийПользователь().Имя); 
КонецПроцедуры

&НаКлиенте
Процедура СтатусОтборПриИзменении(Элемент)
	СтатусОтборПриИзмененииНаСервере();
	Оповестить("ОбновитьОтборыПоПараметрамСеанса");
КонецПроцедуры

&НаСервере
Процедура СтатусОтборПриИзмененииНаСервере()
	ПараметрыСеанса.СтатусОтбор = СтатусОтбор;
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Обработка.НачальнаяСтраница", "СтатусОтбор", СтатусОтбор,,ПользователиИнформационнойБазы.ТекущийПользователь().Имя); 
КонецПроцедуры

#КонецОбласти
