
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьТаблицуПерсонал();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЗаполнитьТаблицуПерсоналВОбъекте();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗагрузкаПлановыхЦенНаРесурсы" Тогда 
		Если ТипЗнч(Параметр) = Тип("Структура") 
			И Параметр.Свойство("УникальныйИдентификаторФормыДокумента") 
			И Параметр.УникальныйИдентификаторФормыДокумента = ЭтаФорма.УникальныйИдентификатор Тогда
			
			Если Параметр.Свойство("НазваниеТаблицы") 
				И Параметр.Свойство("МассивРесурсов") Тогда 
				
				ЗаполнитьТаблицуНаСервере(Параметр.МассивРесурсов, Параметр.НазваниеТаблицы); 
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Инструменты") Тогда 
		Стр = Объект.Инструменты.Добавить();
		Стр.Ресурс = ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ЗагрузитьПерсонал(Команда)
	
	ФормаЗагрузки = ПолучитьФорму("Документ.УстановкаПлановыхЦенНаРесурсы.Форма.ФормаЗагрузкиИзЭксель");
	ФормаЗагрузки.НазваниеТаблицы = "Персонал";
	ФормаЗагрузки.УникальныйИдентификаторФормыДокумента = ЭтаФорма.УникальныйИдентификатор;
	ФормаЗагрузки.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИнструменты(Команда)
	
	ФормаЗагрузки = ПолучитьФорму("Документ.УстановкаПлановыхЦенНаРесурсы.Форма.ФормаЗагрузкиИзЭксель");
	ФормаЗагрузки.НазваниеТаблицы = "Инструменты";
	ФормаЗагрузки.УникальныйИдентификаторФормыДокумента = ЭтаФорма.УникальныйИдентификатор;
	ФормаЗагрузки.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьМатериалы(Команда)
	
	ФормаЗагрузки = ПолучитьФорму("Документ.УстановкаПлановыхЦенНаРесурсы.Форма.ФормаЗагрузкиИзЭксель");
	ФормаЗагрузки.НазваниеТаблицы = "Материалы";
	ФормаЗагрузки.УникальныйИдентификаторФормыДокумента = ЭтаФорма.УникальныйИдентификатор;
	ФормаЗагрузки.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборИнструменты(Команда)
	СтруктураПараметры = Новый Структура("ЗакрыватьПриВыборе, РежимВыбора, ВыборГруппИЭлементов", Ложь, Истина, ИспользованиеГруппИЭлементов.Элементы);	
	
	ОткрытьФорму("Справочник.Инструменты.ФормаВыбора",СтруктураПараметры, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПерсоналПоДолжности(Команда)
	СписокПерсонала = ПолучитьСписокПерсоналаПоДолжности(Элементы.ПерсоналДинамическая.ТекущиеДанные.Ресурс);
	ПоказатьЗначение(Неопределено, СписокПерсонала);
КонецПроцедуры

#КонецОбласти

#Область Персонал

&НаКлиенте
Процедура ДобавитьКолонкуПерсонал(Команда)
	
	ВыбраннаяСтатьяЗатрат = ПредопределенноеЗначение("Справочник.СтатьиЗатрат.ПустаяСсылка");
	
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ДобавитьКолонкуПерсоналЗавершение", ЭтотОбъект, Новый Структура("ВыбраннаяСтатьяЗатрат", ВыбраннаяСтатьяЗатрат)), ВыбраннаяСтатьяЗатрат,"Выберите статью затрат", Тип("СправочникСсылка.СтатьиЗатрат"));
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКолонкуПерсоналЗавершение(Значение, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Значение) Тогда 
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("СтатьяЗатрат",Значение);
	НайдСтр	= Объект.СтатьиЗатрат.НайтиСтроки(ПараметрыОтбора);
	
	Если НЕ НайдСтр.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Стр					= Объект.СтатьиЗатрат.Добавить();
	Стр.СтатьяЗатрат	= Значение;
	
	НовыйРеквизитФормы = Новый РеквизитФормы("СтатьяЗатрат"+Значение.Код,
	Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,2)),
	"ПерсоналДинамическая",
	Значение.Наименование);
	
	МассивРеквизитов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НовыйРеквизитФормы);
	
	ИзменитьРеквизиты(МассивРеквизитов);
	
	НовыйЭлементФормы = Элементы.Добавить("ТЗ"+"СтатьяЗатрат"+Значение.Код, Тип("ПолеФормы"),Элементы.ПерсоналДинамическая);
	НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлементФормы.ПутьКДанным = "ПерсоналДинамическая." + "СтатьяЗатрат"+Значение.Код;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКолонкуПерсонал(Команда)
	
	ВыбраннаяСтатьяЗатрат = ПредопределенноеЗначение("Справочник.СтатьиЗатрат.ПустаяСсылка");
	
	ПоказатьВводЗначения(Новый ОписаниеОповещения("УдалитьКолонкуПерсоналЗавершение", ЭтотОбъект, Новый Структура("ВыбраннаяСтатьяЗатрат", ВыбраннаяСтатьяЗатрат)), ВыбраннаяСтатьяЗатрат,"Выберите статью затрат", Тип("СправочникСсылка.СтатьиЗатрат"));
	
КонецПроцедуры

&НаСервере
Процедура УдалитьКолонкуПерсоналЗавершение(Значение, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Значение) Тогда 
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("СтатьяЗатрат",Значение);
	НайдСтр	= Объект.СтатьиЗатрат.НайтиСтроки(ПараметрыОтбора);
	
	Если НайдСтр.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого Стр Из НайдСтр Цикл
		Объект.СтатьиЗатрат.Удалить(Стр);		
	КонецЦикла;
	
	МассивРеквизитов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ПерсоналДинамическая.СтатьяЗатрат"+Значение.Код);
	
	ИзменитьРеквизиты(,МассивРеквизитов);
	
	Элементы.Удалить(Элементы["ТЗ"+"СтатьяЗатрат"+Значение.Код]);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПерсонал()
	
	МассивРеквизитов = Новый Массив;
	
	Для Каждого Стр Из Объект.СтатьиЗатрат Цикл		
		
		НовыйРеквизитФормы = Новый РеквизитФормы("СтатьяЗатрат"+Стр.СтатьяЗатрат.Код,
		Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,2)),
		"ПерсоналДинамическая",
		Стр.СтатьяЗатрат.Наименование);	
		
		МассивРеквизитов.Добавить(НовыйРеквизитФормы);
		
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивРеквизитов);
	
	Для Каждого Стр Из Объект.СтатьиЗатрат Цикл
		НовыйЭлементФормы = Элементы.Добавить("ТЗ"+"СтатьяЗатрат"+Стр.СтатьяЗатрат.Код, Тип("ПолеФормы"),Элементы.ПерсоналДинамическая);
		НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлементФормы.ПутьКДанным = "ПерсоналДинамическая." + "СтатьяЗатрат"+Стр.СтатьяЗатрат.Код;	
	КонецЦикла;
	
	Для Каждого Стр Из Объект.Персонал Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Ресурс",Стр.Ресурс);
		НайдСтр = ПерсоналДинамическая.НайтиСтроки(ПараметрыОтбора);
		
		Если НайдСтр.Количество() = 0 Тогда 
			НоваяСтр		= ПерсоналДинамическая.Добавить();
			НоваяСтр.Ресурс	= Стр.Ресурс;
		Иначе
			НоваяСтр = НайдСтр[0];	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.СтатьяЗатрат.Код) Тогда 
			НоваяСтр["СтатьяЗатрат"+Стр.СтатьяЗатрат.Код] = Стр.Цена;
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПерсоналВОбъекте()
	
	Объект.Персонал.Очистить();
	
	ПерсоналДинамическаяЗначение = РеквизитФормыВЗначение("ПерсоналДинамическая");
	
	Для Каждого Стр Из ПерсоналДинамическая Цикл
		
		Для Каждого Колонка Из ПерсоналДинамическаяЗначение.Колонки Цикл
			
			Если Колонка.Имя = "Ресурс" Тогда 
				Продолжить;
			КонецЕсли;
			
			СтрНовая				= Объект.Персонал.Добавить();
			СтрНовая.Ресурс			= Стр.Ресурс;
			СтрНовая.СтатьяЗатрат	= Справочники.СтатьиЗатрат.НайтиПоКоду(СтрЗаменить(Колонка.Имя,"СтатьяЗатрат",""));
			СтрНовая.Цена			= Стр[Колонка.Имя];
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуНаСервере(МассивРесурсов, НазваниеТаблицы)
	
	ТаблицаРесурсов = Объект[НазваниеТаблицы];
	
	Для Каждого ЭлементРесурс Из МассивРесурсов Цикл
		
		Стр = ТаблицаРесурсов.Добавить();
		
		Если НазваниеТаблицы = "Персонал" Тогда
			Ресурс = Справочники.Должности.НайтиПоКоду(ЭлементРесурс.Код);
			Если НЕ ЗначениеЗаполнено(Ресурс) Тогда 
				Ресурс = Справочники.Должности.НайтиПоНаименованию(ЭлементРесурс.Ресурс);
			КонецЕсли;
			Стр.Ресурс = Ресурс;
		ИначеЕсли НазваниеТаблицы = "Инструменты" Тогда 
			Ресурс = Справочники.Инструменты.НайтиПоКоду(ЭлементРесурс.Код);
			Если НЕ ЗначениеЗаполнено(Ресурс) Тогда 
				Ресурс = Справочники.Инструменты.НайтиПоНаименованию(ЭлементРесурс.Ресурс);
			КонецЕсли;
			Стр.Ресурс = Ресурс;
		ИначеЕсли НазваниеТаблицы = "Материалы" Тогда
			Ресурс = Справочники.Материалы.НайтиПоКоду(ЭлементРесурс.Код);
			Если НЕ ЗначениеЗаполнено(Ресурс) Тогда 
				Ресурс = Справочники.Материалы.НайтиПоНаименованию(ЭлементРесурс.Ресурс);
			КонецЕсли;
			Стр.Ресурс = Ресурс;
		КонецЕсли;
		
		Стр.Цена = ЭлементРесурс.Цена;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокПерсоналаПоДолжности(Должность)
	
	СписокПерсонала = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Персонал.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Персонал КАК Персонал
		|ГДЕ
		|	Персонал.Должность = &Должность";
	
	Запрос.УстановитьПараметр("Должность", Должность);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокПерсонала.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат СписокПерсонала;

КонецФункции

#КонецОбласти