#Область СобытияФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостью();
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ИспользуетсяТолькоВОпределенныеМесяцыПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяТолькоДляПерсоналаОдногоПолаПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеВидимостью()
	
	Если Объект.ИспользуетсяТолькоВОпределенныеМесяцы Тогда 
		Элементы.ГруппаМесяцыИспользования.Видимость = Истина;
	Иначе
		Элементы.ГруппаМесяцыИспользования.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.ИспользуетсяТолькоДляПерсоналаОдногоПола Тогда 
		Элементы.Пол.Видимость = Истина;
	Иначе
		Элементы.Пол.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти