
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Родитель = Параметры.Родитель;
	Ссылка = Параметры.Ссылка;
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ДоговорКонтрагентаМассив = ПолучитьДоговорКонтрагента(Ссылка);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДоговорКонтрагентаМассив) Тогда
		ЗаполнитьТаблицуОплатУчетнойСистемы(ДоговорКонтрагентаМассив);
		ЗаполнитьТаблицуНачисленийУчетнойСистемы(ДоговорКонтрагентаМассив);
	КонецЕсли;
	ТипДоговора = Параметры.ТипДоговора;
	Если ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.ДТ2") ИЛИ ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.ДТ4") Тогда
		СтатьяЗатрат = Параметры.СтатьяЗатрат;
	КонецЕсли;
	ТЗ = ПолучитьИзВременногоХранилища(Параметры.АдресТЗ);
	//ЗаполнитьПоРодителю(Родитель, ТЗ);
	Элементы.ОплатыСтатьяЗатрат.Видимость = ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.ДТ2") ИЛИ ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.ДТ4"); 
	
	Оплаты.Загрузить(ТЗ);
	
	ПолноправныйПольователь = Пользователи.РолиДоступны("КЛадо_Администрирование, КЛАДО_РедактировниеНачисленийИОплатДоговоров", Пользователи.ТекущийПользователь());
	Элементы.ФормаПеренестиВДокумент.Доступность = ПолноправныйПольователь;
	Элементы.Оплаты.ТолькоПросмотр =  НЕ ПолноправныйПольователь;
	
	Если ИспользованиеПометкиУдаления() Тогда
		Элементы.ОплатыПометкаУдаления.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьАдресТЗ()
	ТЗ = Оплаты.Выгрузить(); 
	//ТЗ.Свернуть("Период, СтатьяЗатрат", "СуммаНачисления, СуммаОплаты, ПометкаУдаления");
	Возврат ПоместитьВоВременноеХранилище(ТЗ);
КонецФункции

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	Результат = СформироватьАдресТЗ();
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура ОплатыПриИзменении(Элемент)
	СуммаОплатыИтог = Оплаты.Итог("СуммаОплаты");
	СуммаНачисленияИтог = Оплаты.Итог("СуммаНачисления");
КонецПроцедуры

&НаКлиенте
Процедура ОплатыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекущиеДанные = Элементы.Оплаты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	Если НоваяСтрока Тогда
		ТекущиеДанные.СтатьяЗатрат = СтатьяЗатрат;		
	КонецЕсли;
КонецПроцедуры



&НаКлиенте
Процедура ОплатыСуммаНачисленияОбщаяПриИзменении(Элемент)
	//ТекущиеДанные = Элементы.Оплаты.ТекущиеДанные;
	//Если ТекущиеДанные = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//ТекущиеДанные.СуммаНачисления = ТекущиеДанные.СуммаНачисленияОбщая - ТекущиеДанные.СуммаНачисленияРодитель;
КонецПроцедуры

&НаКлиенте
Процедура ОплатыСуммаОплатыОбщаяПриИзменении(Элемент)
	//ТекущиеДанные = Элементы.Оплаты.ТекущиеДанные;
	//Если ТекущиеДанные = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//ТекущиеДанные.СуммаОплаты = ТекущиеДанные.СуммаОплатыОбщая - ТекущиеДанные.СуммаОплатыРодитель;
КонецПроцедуры

&НаКлиенте
Процедура ОплатыСуммаНачисленияПриИзменении(Элемент)
	//ТекущиеДанные = Элементы.Оплаты.ТекущиеДанные;
	//Если ТекущиеДанные = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//ТекущиеДанные.СуммаНачисленияОбщая = ТекущиеДанные.СуммаНачисления + ТекущиеДанные.СуммаНачисленияРодитель;
КонецПроцедуры

&НаКлиенте
Процедура ОплатыСуммаОплатыПриИзменении(Элемент)
	//ТекущиеДанные = Элементы.Оплаты.ТекущиеДанные;
	//Если ТекущиеДанные = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//ТекущиеДанные.СуммаОплатыОбщая = ТекущиеДанные.СуммаОплаты + ТекущиеДанные.СуммаОплатыРодитель;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьДоговорКонтрагента(Договор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоответствиеДоговоров.ДоговорИзУчетнойСистемы КАК ДоговорИзУчетнойСистемы
		|ИЗ
		|	РегистрСведений.СоответствиеДоговоров КАК СоответствиеДоговоров
		|ГДЕ
		|	СоответствиеДоговоров.Договор = &Договор";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивДоговоровКонтрагента = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивДоговоровКонтрагента.Добавить(ВыборкаДетальныеЗаписи.ДоговорИзУчетнойСистемы);
	КонецЦикла;
	
	Возврат МассивДоговоровКонтрагента
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуОплатУчетнойСистемы(ДоговорКонтрагента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗатратыИзУчетнойСистемыОбороты.Регистратор КАК Регистратор,
		|	ЗатратыИзУчетнойСистемыОбороты.Период КАК Период,
		|	ЗатратыИзУчетнойСистемыОбороты.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	ЗатратыИзУчетнойСистемыОбороты.СтатьяЗатрат КАК СтатьяЗатрат,
		|	ЗатратыИзУчетнойСистемыОбороты.ДоговорИзУчетнойСистемы КАК ДоговорКонтрагента,
		|	ЗатратыИзУчетнойСистемыОбороты.СуммаЗатратОборот КАК СуммаЗатрат
		|ИЗ
		|	РегистрНакопления.ЗатратыИзУчетнойСистемы.Обороты(, , Регистратор, ДоговорИзУчетнойСистемы В (&ДоговорКонтрагента)) КАК ЗатратыИзУчетнойСистемыОбороты";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ИтогСуммаЗатратУС = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ОплатыУчетнойСистемы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		ИтогСуммаЗатратУС = ИтогСуммаЗатратУС + ВыборкаДетальныеЗаписи.СуммаЗатрат;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНачисленийУчетнойСистемы(ДоговорКонтрагента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачисленияИзУчетнойСистемыОбороты.Регистратор КАК Регистратор,
		|	НачисленияИзУчетнойСистемыОбороты.Период КАК Период,
		|	НачисленияИзУчетнойСистемыОбороты.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	НачисленияИзУчетнойСистемыОбороты.СтатьяЗатрат КАК СтатьяЗатрат,
		|	НачисленияИзУчетнойСистемыОбороты.ДоговорИзУчетнойСистемы КАК ДоговорКонтрагента,
		|	НачисленияИзУчетнойСистемыОбороты.СуммаОборот КАК Сумма
		|ИЗ
		|	РегистрНакопления.НачисленияИзУчетнойСистемы.Обороты(, , Регистратор, ДоговорИзУчетнойСистемы В (&ДоговорКонтрагента)) КАК НачисленияИзУчетнойСистемыОбороты";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ИтогСуммаНачисленийУС = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = НачисленияУчетнойСистемы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		ИтогСуммаНачисленийУС = ИтогСуммаНачисленийУС + ВыборкаДетальныеЗаписи.Сумма;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыПередУдалением(Элемент, Отказ)
	Если ИспользованиеПометкиУдаления() Тогда 
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИспользованиеПометкиУдаления()
	Возврат Константы.ИспользоватьПометкуУдаленияВСтрокахТаблицДоговоров.Получить()
КонецФункции
