
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр УчетВремениПерсонала Расход
	Движения.УчетВремениПерсонала.Записывать = Истина;
	Для Каждого ТекСтрокаВремя Из Время Цикл
		Движение = Движения.УчетВремениПерсонала.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Должность = ТекСтрокаВремя.Должность;
		Движение.Месяц = ТекСтрокаВремя.Месяц;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = ТекСтрокаВремя.КоличествоЧасов;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
