

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущийСотрудник = Пользователи.ТекущийПользователь().Сотрудник;
	Если Не ЗначениеЗаполнено(ТекущийСотрудник) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить текущего сотрудника пользователя!");
	КонецЕсли;
	ОтображатьВсеДанные = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийСотрудник, "Должность.ОтображатьВсеДанные"); 
	Если Не ЗначениеЗаполнено(ОтображатьВсеДанные) Тогда
		//добавляем отбор по объектам
		СписокПроектов = КЛАДО_ОбщийМодульСервер.ПолучитьСписокПроектовТекущегоСотрудника(ТекущийСотрудник);
		СписокДоговоровПодразделений = КЛАДО_ОбщийМодульСервер.ПолучитьСписокДоговоровРуководителяПодразделения(ТекущийСотрудник);
		ГруппаОтборов = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Список.Отбор.Элементы, "Отбор по сотруднику", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтборов, "Проект", СписокПроектов, ВидСравненияКомпоновкиДанных.ВСписке);  
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтборов, "Ссылка", СписокДоговоровПодразделений, ВидСравненияКомпоновкиДанных.ВСписке);  
	КонецЕсли;
	ДобавитьОтборыПоПараметрамСеанса();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОтборыПоПараметрамСеанса()
	
	//КЛАДО_ОбщийМодульСервер.ДобавитьОтборыПоПараметрамСеанса(Список, Новый ПолеКомпоновкиДанных("Администратор"), ПараметрыСеанса.СотрудникОтбор, ЗначениеЗаполнено(ПараметрыСеанса.СотрудникОтбор));
	//ПодразделениеОтбор = ПараметрыСеанса.ПодразделениеОтбор;
	//Если ЗначениеЗаполнено(ПодразделениеОтбор) Тогда
	//	СписокДоговоровПодразделений = КЛАДО_ОбщийМодульСервер.ПолучитьСписокДоговоровПодразделения(ПодразделениеОтбор);
	//Иначе 
	//	СписокДоговоровПодразделений = Новый Массив;
	//КонецЕсли;
	//КЛАДО_ОбщийМодульСервер.ДобавитьОтборыПоПараметрамСеанса(Список, Новый ПолеКомпоновкиДанных("Ссылка"), СписокДоговоровПодразделений, ЗначениеЗаполнено(ПодразделениеОтбор), ВидСравненияКомпоновкиДанных.ВСписке);
	
	СотрудникОтбор		= ПараметрыСеанса.СотрудникОтбор;
	ПодразделениеОтбор	= ПараметрыСеанса.ПодразделениеОтбор;
	ОрганизацияОтбор	= ПараметрыСеанса.ОрганизацияОтбор;
	
	Если ЗначениеЗаполнено(СотрудникОтбор) ИЛИ ЗначениеЗаполнено(ПодразделениеОтбор) Тогда
		СписокДоговоров = КЛАДО_ОбщийМодульСервер.ПолучитьСписокДоговоровАдминистраторЗадачи(СотрудникОтбор, ПодразделениеОтбор);
	Иначе 
		СписокДоговоров = Новый Массив;
	КонецЕсли;
	
	КЛАДО_ОбщийМодульСервер.ДобавитьОтборыПоПараметрамСеанса(Список, Новый ПолеКомпоновкиДанных("Ссылка"), СписокДоговоров, ЗначениеЗаполнено(СотрудникОтбор) ИЛИ ЗначениеЗаполнено(ПодразделениеОтбор), ВидСравненияКомпоновкиДанных.ВСписке);
	КЛАДО_ОбщийМодульСервер.ДобавитьОтборыПоПараметрамСеанса(Список, Новый ПолеКомпоновкиДанных("Организация"), ОрганизацияОтбор, ЗначениеЗаполнено(ОрганизацияОтбор), ВидСравненияКомпоновкиДанных.Равно);
	
	ОбновитьОтображениеПланФакт();
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьОтборыПоПараметрамСеанса" Тогда
		ДобавитьОтборыПоПараметрамСеанса();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Тест(Команда)
	ОтображатьТолькоТест = Истина;
	ОбновитьОтображениеПланФакт();
КонецПроцедуры

&НаКлиенте
Процедура План(Команда)
	ОтображатьТолькоПлан = Истина;
	ОтображатьТолькоТест = Ложь;
	ОбновитьОтображениеПланФакт();
КонецПроцедуры

&НаКлиенте
Процедура Факт(Команда)
	ОтображатьТолькоПлан = Ложь;
	ОтображатьТолькоТест = Ложь;
	ОбновитьОтображениеПланФакт();
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеПланФакт()
	Если ОтображатьТолькоПлан Тогда 
		Элементы.ФормаПлан.Пометка = Истина;
		Элементы.ФормаФакт.Пометка = Ложь;
		Элементы.ФормаТест.Пометка = Ложь;
		КЛАДО_ОбщийМодульСервер.ДобавитьОтборыПоПараметрамСеанса(Список, Новый ПолеКомпоновкиДанных("СостояниеИсполнения"), Перечисления.СтатусыДоговоровПроектов.Планируемый, Истина, ВидСравненияКомпоновкиДанных.Равно);
	Иначе 
		Элементы.ФормаПлан.Пометка = Ложь;
		Элементы.ФормаФакт.Пометка = Истина;
		Элементы.ФормаТест.Пометка = Ложь;
		КЛАДО_ОбщийМодульСервер.ДобавитьОтборыПоПараметрамСеанса(Список, Новый ПолеКомпоновкиДанных("СостояниеИсполнения"), Перечисления.СтатусыДоговоровПроектов.Исполняемый, Истина, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	Если ОтображатьТолькоТест Тогда 
		Элементы.ФормаПлан.Пометка = Ложь;
		Элементы.ФормаФакт.Пометка = Ложь; 
		Элементы.ФормаТест.Пометка = Истина;
		КЛАДО_ОбщийМодульСервер.ДобавитьОтборыПоПараметрамСеанса(Список, Новый ПолеКомпоновкиДанных("СостояниеИсполнения"), Перечисления.СтатусыДоговоровПроектов.Тестируемый, Истина, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для Каждого Эл Из Список.Отбор.Элементы Цикл
		Если Эл.Представление = "Отбор по сотруднику" Тогда 
			Эл.Использование = Ложь;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
