
&НаКлиенте
Процедура МатериалыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрокаМатериалы = Элементы.Материалы.ТекущиеДанные;
	
	Если ТекущаяСтрокаМатериалы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	НайденныйМатериал = ВыбранныеМатериалы.НайтиПоЗначению(ТекущаяСтрокаМатериалы.Материал);
	
	Если НайденныйМатериал = Неопределено Тогда
		ВыбранныеМатериалы.Добавить(ТекущаяСтрокаМатериалы.Материал);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	МассивМатериалов = ВыбранныеМатериалы.ВыгрузитьЗначения();
	Закрыть(МассивМатериалов);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМатериаловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрокаМатериалы = ТаблицаМатериалов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если ТекущаяСтрокаМатериалы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ТекущийМатериал = ТекущаяСтрокаМатериалы.Материал;
	
	НайденныйМатериал = ВыбранныеМатериалы.НайтиПоЗначению(ТекущийМатериал);
	
	Если НайденныйМатериал = Неопределено Тогда
		ВыбранныеМатериалы.Добавить(ТекущийМатериал);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыМатериалы.Материал КАК Материал
	|ИЗ
	|	Справочник.Договоры.Материалы КАК ДоговорыМатериалы
	|ГДЕ
	|	ДоговорыМатериалы.Ссылка = &Договор
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗаявкаНаРесурсыМатериалы.Материал
	|ИЗ
	|	Документ.ЗаявкаНаРесурсы.Материалы КАК ЗаявкаНаРесурсыМатериалы
	|ГДЕ
	|	ЗаявкаНаРесурсыМатериалы.Ссылка.Договор = &Договор
	|	И ЗаявкаНаРесурсыМатериалы.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ЗаявкаНаРесурсыМатериалы.Ссылка.Проведен = ИСТИНА";
	Запрос.УстановитьПараметр("Договор", Параметры.Договор); 
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		НоваяСтрокаМатериалы = ТаблицаМатериалов.Добавить();
		НоваяСтрокаМатериалы.Материал = РезультатЗапроса.Материал;
		НоваяСтрокаМатериалы.Картинка = БиблиотекаКартинок.Справочник;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПодобранныеМатериалы(Команда)
	ВыбранныеМатериалы.Очистить();
КонецПроцедуры
