
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр НачисленияОплатыПоДоговорам 
	Движения.НачисленияОплатыПоДоговорам.Записывать = Истина;
	Для Каждого ТекСтрокаНачисленияОплаты Из НачисленияОплаты Цикл
		Движение = Движения.НачисленияОплатыПоДоговорам.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = ТекСтрокаНачисленияОплаты.Контрагент;
		Движение.Договор = ТекСтрокаНачисленияОплаты.Договор;
		Движение.СуммаНачисления = ТекСтрокаНачисленияОплаты.СуммаНачисления;
		Движение.СуммаОплаты = ТекСтрокаНачисленияОплаты.СуммаОплаты;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Организация = Константы.ОрганизацияПоУмолчанию.Получить();
КонецПроцедуры
