
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого СтруктураСтроки Из Параметры.СтруктураСтроки Цикл
		
		ЗаполнитьЗначенияСвойств(ТаблицаДней.Добавить(), СтруктураСтроки); 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПричиныОтсутствия(Команда)
	
	ЗаполнитьПоТекущейСтроке("ПричинаОтсутствия");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЧасы(Команда)
	ЗаполнитьПоТекущейСтроке("Часы");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоТекущейСтроке(КлючЗаполнения)
	
	ТекущаяСтрокаТаблицы = Элементы.ТаблицаДней.ТекущиеДанные;
	
	Если ТекущаяСтрокаТаблицы = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	
	Для каждого СтрокаТаблицы Из ТаблицаДней Цикл
		
		СтрокаТаблицы[КлючЗаполнения] = ТекущаяСтрокаТаблицы[КлючЗаполнения];
		
	КонецЦикла; 
	
КонецПроцедуры 

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	СтруктураРезультата = Новый Массив;
	
	МассивРезультат = Новый Массив; 
	
	Для каждого СтрокаТаблицы Из ТаблицаДней Цикл
		
		СтруктураСтроки = Новый Структура("НомерДня, ПричинаОтсутствия, Часы");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаТаблицы);
		
		МассивРезультат.Добавить(СтруктураСтроки);
		
	КонецЦикла; 
	
	Закрыть(МассивРезультат);

КонецПроцедуры
