#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет настройки, влияющие на использование плана обмена.
// 
// Параметры:
//  Настройки - Структура - см. ОбменДаннымиСервер.НастройкиПланаОбменаПоУмолчанию
//
Процедура ПриПолученииНастроек(Настройки) Экспорт
		
	Настройки.ИмяКонфигурацииИсточника = "КЛАДО";
	Настройки.ИмяКонфигурацииПриемника.Вставить("КомплексноеУправлениеФинансамиИБюджетированиеДляКазахстана");
		
	Настройки.Алгоритмы.ПриПолученииОписанияВариантаНастройки = Истина;
		
КонецПроцедуры

// Заполняет набор параметров, определяющих вариант настройки обмена.
// 
// Параметры:
//  ОписаниеВарианта       - см. ОбменДаннымиСервер.ОписаниеВариантаНастройкиОбменаПоУмолчанию
//  ИдентификаторНастройки - Строка - идентификатор варианта настройки обмена.
//  ПараметрыКонтекста     - см. ОбменДаннымиСервер.ПараметрыКонтекстаПолученияОписанияВариантаНастройки
//
Процедура ПриПолученииОписанияВариантаНастройки(ОписаниеВарианта, ИдентификаторНастройки, ПараметрыКонтекста) Экспорт
	
    КраткаяИнформацияПоОбмену = НСтр("ru = 'Данная настройка позволит синхронизировать данные между программами 1С: Кладо 1.0 и 1С: Комплексное управление финансами и Бюджетирование для Казахстана, редакция 3.1'");
    
	ОписаниеВарианта.КраткаяИнформацияПоОбмену   = КраткаяИнформацияПоОбмену;
	
    ОписаниеВарианта.ИмяКонфигурацииКорреспондента             = НСТр("ru = '1С: КУФИБ ред. 3.1'");
    ОписаниеВарианта.НаименованиеКонфигурацииКорреспондента    = НСтр("ru = '1С: Комплексное управление финансами и Бюджетирование для Казахстана, редакция 3.1'");
    ОписаниеВарианта.ИмяФайлаНастроекДляПриемника              = НСтр("ru = 'Настройки синхронизации для КУФИБ ред. 3.1'");
    ОписаниеВарианта.ИмяФормыСозданияНачальногоОбраза          = "";
    ОписаниеВарианта.ИспользоватьПомощникСозданияОбменаДанными = Истина;
	ОписаниеВарианта.ИспользуемыеТранспортыСообщенийОбмена = ИспользуемыеТранспортыСообщенийОбмена();
    
    ЗаголовокКоманды   = НСтр("ru = '1С: Комплексное управление финансами и Бюджетирование для Казахстана, редакция 3.1'");
    ЗаголовокПомощника = НСтр("ru = 'Синхронизация данных с 1С: Комплексное управление финансами и Бюджетирование для Казахстана, редакция 3.1 (настройка)'");
    ЗаголовокУзла      = НСтр("ru = 'Синхронизация данных с 1С: Комплексное управление финансами и Бюджетирование для Казахстана, редакция 3.1'");
			
	ОписаниеВарианта.ЗаголовокКомандыДляСозданияНовогоОбменаДанными = ЗаголовокКоманды;
	ОписаниеВарианта.ЗаголовокПомощникаСозданияОбмена               = ЗаголовокПомощника;
	ОписаниеВарианта.ЗаголовокУзлаПланаОбмена                       = ЗаголовокУзла;
		
КонецПроцедуры

Функция ИспользуемыеТранспортыСообщенийОбмена() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Перечисления.ВидыТранспортаСообщенийОбмена.FTP);
	Массив.Добавить(Перечисления.ВидыТранспортаСообщенийОбмена.FILE);
	
	Возврат Массив;
	
КонецФункции

#КонецОбласти

#КонецЕсли
