
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Затраты 
	Движения.ЗатратыРаспределенные.Записывать = Истина;
	Для Каждого ТекСтрокаЗатраты Из Затраты Цикл
		Движение = Движения.ЗатратыРаспределенные.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.СтатьяЗатрат = СтатьяЗатрат;
		Движение.Подразделение = ТекСтрокаЗатраты.Подразделение;
		Движение.Договор = ТекСтрокаЗатраты.Договор;
		Движение.СуммаЗатрат = ТекСтрокаЗатраты.СуммаЗатрат;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Организация = Константы.ОрганизацияПоУмолчанию.Получить();
КонецПроцедуры
