
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Тарифы
	Движения.Тарифы.Записывать = Истина;
	Для Каждого ТекСтрокаТарифы Из Тарифы Цикл
		Движение = Движения.Тарифы.Добавить();
		Движение.Период = Дата;
		Движение.НаименованиеРаботы = ТекСтрокаТарифы.НаименованиеРаботы;
		Движение.Месторождение = Месторождение;
		Движение.Цех = Цех;
		Движение.Цена = ТекСтрокаТарифы.Цена;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
